wolfSSL/wolfssl/wolfcrypt/src/port/realtek/rtl8735b.c
/* rtl8735b.c
 *
 * Copyright (C) 2006-2026 wolfSSL Inc.
 *
 * This file is part of wolfSSL.
 *
 * wolfSSL is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * wolfSSL is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA
 */

#ifdef HAVE_CONFIG_H
    #include <config.h>
#endif

#include <wolfssl/wolfcrypt/settings.h>

#if defined(WOLFSSL_RTL8735B_HUK) || defined(WOLFSSL_RTL8735B_AES)

#include <wolfssl/wolfcrypt/port/realtek/rtl8735b.h>
#include <wolfssl/wolfcrypt/types.h>
#include <wolfssl/wolfcrypt/error-crypt.h>
#include <wolfssl/wolfcrypt/logging.h>
#include <wolfssl/wolfcrypt/wc_port.h>

#ifdef WOLF_CRYPTO_CB
    #include <wolfssl/wolfcrypt/cryptocb.h>
#endif
#ifndef NO_AES
    #include <wolfssl/wolfcrypt/aes.h>
#endif
#if !defined(NO_HMAC) && !defined(NO_SHA256)
    #include <wolfssl/wolfcrypt/hmac.h>
#endif
#ifdef HAVE_ECC
    #include <wolfssl/wolfcrypt/ecc.h>
#endif

#ifdef NO_INLINE
    #include <wolfssl/wolfcrypt/misc.h>
#else
    #define WOLFSSL_MISC_INCLUDED
    #include <wolfcrypt/src/misc.c>
#endif

/* Vendor HAL surface: the real SDK headers on target, the host-test shim under
 * --enable-rtl8735b (see rtl8735b_shim.h). The on-target include path is
 * supplied by the application / board CMake (see this port's README). */
#ifdef WOLFSSL_RTL8735B_HOST_TEST
    #include "rtl8735b_shim.h"
#else
    #include "hal_crypto.h"          /* AES engine -- used by both devices */
    #ifdef WOLFSSL_RTL8735B_HUK
        /* HKDF key-ladder, secure TRNG and HW ECDSA are HUK-device only, so an
         * AES-only build (WOLFSSL_RTL8735B_AES without _HUK) need not supply
         * these HAL headers. */
        #include "hal_hkdf.h"
        #ifndef WC_NO_RNG
            #include "hal_trng_sec.h"
        #endif
        #if defined(HAVE_ECC) && defined(HAVE_ECC_SIGN)
            #include "hal_ecdsa.h"
        #endif
    #endif
#endif

#ifdef WOLF_CRYPTO_CB

/* HUK-derived working key is always a 256-bit key. */
#define WC_RTL8735B_KEYLEN 32

/* The HAL crypto engine DMAs its buffers on 32-byte (cache line) boundaries.
 * Unaligned caller buffers are bounced through an aligned heap temp: over-
 * allocate by 31 and round the usable pointer up; keep the raw pointer for XFREE. */
#define WC_RTL8735B_IS_ALIGNED32(p) ((((wc_ptr_t)(p)) & 31u) == 0)
#define WC_RTL8735B_ALIGN_UP32(p) \
    ((byte*)((((wc_ptr_t)(p)) + 31u) & ~(wc_ptr_t)31u))
/* Largest length we will bounce: leaves headroom so (sz + 31) cannot wrap.
 * Anything larger is rejected (defensive; not reachable in device RAM). */
#define WC_RTL8735B_BOUNCE_MAX  (0xFFFFFFFFUL - 32u)

/* CRYPTO_MAX_AAD_LENGTH in the vendor HAL: the engine's AAD FIFO. A longer
 * header is rejected with _ERRNO_CRYPTO_AAD_OutRange (-10). */
#ifndef WC_RTL8735B_MAX_AAD
    #define WC_RTL8735B_MAX_AAD 496u
#endif

/* Report a vendor HAL failure with its raw return code before collapsing it to
 * WC_HW_E. The codes are the _ERRNO_CRYPTO_* set in the AmebaPro2 HAL's
 * hal_crypto.h; the ones seen in practice are:
 *    -1  FAIL             -- the crypto done-IRQ never arrived. On a non-SDK
 *                            RTOS (e.g. Zephyr) this means the HAL's ISR was
 *                            never wired into the live vector table; see the
 *                            bring-up notes in this port's README.
 *    -4  NULL_POINTER
 *    -5  ENGINE_NOT_INIT  -- hal_crypto_engine_init() not run, or run against
 *                            the other security state's adapter.
 *    -6  ADDR_NOT_32Byte_Aligned -- key / IV / AAD not 32-byte aligned.
 *   -10  AAD_OutRange     -- aadLen > WC_RTL8735B_MAX_AAD.
 *   -12  CIPHER_TYPE_NOT_MATCH -- an op without its matching *_init.
 *   -14  AES_MSGLEN_NOT_16Byte_Aligned
 *   -19  CACHE_HANDLE
 * Without WOLFSSL_DEBUG this compiles away and only the WC_HW_E remains. */
#define WC_RTL8735B_HW_FAIL(fn, rc)                                          \
    WOLFSSL_MSG_EX("rtl8735b: %s failed, hal=%d", (fn), (int)(rc))

#if defined(HAVE_ECC) && defined(HAVE_ECC_SIGN)
/* HW ECDSA engine is wired for 256-bit curves (P-256); big ints cross the HAL as
 * little-endian 32-bit word arrays. Used by the ECDSA paths and result state. */
#define WC_RTL8735B_ECC_BYTES   32
#define WC_RTL8735B_ECC_WORDS   (WC_RTL8735B_ECC_BYTES / 4)
#endif

/* --- bounce-buffer helpers (HAL DMA needs 32-byte alignment) --- */

/* Stage an unaligned input on a 32-byte-aligned heap temp. *aligned <- aligned
 * pointer (src if already aligned, NULL for sz==0); *allocp <- buffer to free
 * (NULL if none). Caller bounds sz to WC_RTL8735B_BOUNCE_MAX. 0 or MEMORY_E. */
static int Rtl8735b_BounceIn(const byte* src, word32 sz, const byte** aligned,
    byte** allocp)
{
    byte* b;
    *allocp = NULL;
    if (sz == 0 || WC_RTL8735B_IS_ALIGNED32(src)) {
        *aligned = src;
        return 0;
    }
    b = (byte*)XMALLOC(sz + 31, NULL, DYNAMIC_TYPE_TMP_BUFFER);
    if (b == NULL) {
        return MEMORY_E;
    }
    *allocp  = b;
    *aligned = WC_RTL8735B_ALIGN_UP32(b);
    XMEMCPY((byte*)*aligned, src, sz);
    return 0;
}

/* Allocate a 32-byte-aligned output bounce of sz bytes. *aligned <- usable
 * pointer, *allocp <- buffer to free. Caller bounds sz. 0 or MEMORY_E. */
static int Rtl8735b_BounceOut(word32 sz, byte** aligned, byte** allocp)
{
    byte* b = (byte*)XMALLOC(sz + 31, NULL, DYNAMIC_TYPE_TMP_BUFFER);
    if (b == NULL) {
        return MEMORY_E;
    }
    *allocp  = b;
    *aligned = WC_RTL8735B_ALIGN_UP32(b);
    return 0;
}

/* Release a bounce: scrub the aligned (plaintext) view, then free the raw
 * allocation. No-op when alloc is NULL. */
static void Rtl8735b_BounceFree(byte* alloc, byte* aligned, word32 sz)
{
    if (alloc != NULL) {
        if (sz > 0) {
            ForceZero(aligned, sz);
        }
        XFREE(alloc, NULL, DYNAMIC_TYPE_TMP_BUFFER);
    }
}

