wolfSSL/wolfssl/wolfcrypt/src/port/realtek/rtl8735b.c
/* --- module state: file-scope globals, each touched only with the crypto mutex
 * held (every HW path locks first), so safe across concurrent objects. These
 * belong to the HUK device; the plaintext-key AES device keeps no key state. --- */
#ifdef WOLFSSL_RTL8735B_HUK

/* Derivation cache: the seed whose working key currently resides in the derived
 * slot WC_RTL8735B_DERIVED_WB_IDX. Single slot, so interleaving distinct seeds
 * misses every call and gains nothing (still correct -- re-derived under the
 * mutex). Seed is HKDF input, not secret, but scrubbed on unregister. Define
 * WC_RTL8735B_NO_DERIVE_CACHE to disable. */
#ifndef WC_RTL8735B_NO_DERIVE_CACHE
static byte huk_seedCache[WC_RTL8735B_KEYLEN];
static int  huk_haveCache = 0;
#endif

#if defined(HAVE_ECC) && defined(HAVE_ECC_SIGN)
/* HW ECDSA finish-IRQ completion state. The op runs under the crypto mutex, so
 * these are safe; the ISR fills them and sets huk_ecdsaDone last. Only the flag
 * is volatile (the sync point); results are read after the flag is seen set and
 * after hal_ecdsa_deinit() (a compiler barrier), so they need not be -- which
 * also avoids volatile-discarding casts at the HAL/XMEMCPY boundary. */
static volatile int    huk_ecdsaDone;
static volatile word32 huk_ecdsaErr;
static word32          huk_ecdsaR[WC_RTL8735B_ECC_WORDS];
static word32          huk_ecdsaS[WC_RTL8735B_ECC_WORDS];
#ifdef HAVE_ECC_VERIFY
static volatile word32 huk_veriResult;
#endif
/* The finish-IRQ callback is registered with the address of this adapter; it is
 * file-scope (not a stack local) so a late IRQ arriving after a spin-timeout
 * return dereferences valid memory, not a dead stack frame. Mutex-serialized, so
 * one shared instance is safe across the sign/verify paths. */
static hal_ecdsa_adapter_t huk_ecdsaAdapter;
#endif

#ifndef WC_NO_RNG
/* Lazily-initialized secure TRNG (a peripheral distinct from the AES/HKDF engine). */
static int huk_trngInit = 0;
#endif
#endif /* WOLFSSL_RTL8735B_HUK (module state) */

/* One-time HW crypto engine bring-up, shared by the HUK and plaintext-key AES
 * devices. Idempotent on the HAL side. */
static int Rtl8735bHuk_Init(void* ctx)
{
    int hw;

    (void)ctx;
    hw = hal_crypto_engine_init();
    if (hw != 0) {
        WC_RTL8735B_HW_FAIL("crypto_engine_init", hw);
        return WC_HW_E;
    }
    return 0;
}

#if defined(WOLFSSL_RTL8735B_AES) && !defined(NO_AES)
/* ------------------------------------------------------------------------- *
 * Plaintext-key AES device
 *
 * Runs a caller-supplied AES key directly on the HW AES engine (raw-key HAL
 * init, no HUK/HKDF key ladder). Registered at WC_RTL8735B_AES_DEVID, it
 * coexists with the HUK device (WC_HUK_DEVID): an Aes bound to this devId uses
 * its key verbatim; one bound to the HUK devId uses the key as a 256-bit
 * derivation seed. Unlike the HUK device, 128/192/256-bit keys are all handled.
 * ------------------------------------------------------------------------- */

/* Point *key at the plaintext key the Aes carries in devKey (the raw copy the
 * key API makes under WOLF_CRYPTO_CB) and return its byte length. A non-AES key
 * size returns CRYPTOCB_UNAVAILABLE so the caller falls back to software. */
static int Rtl8735bAes_Key(Aes* aes, const byte** key, word32* keyLen)
{
    if (aes == NULL || key == NULL || keyLen == NULL) {
        return BAD_FUNC_ARG;
    }
    if (aes->keylen != 16 && aes->keylen != 24 && aes->keylen != 32) {
        return CRYPTOCB_UNAVAILABLE;
    }
    *key    = (const byte*)aes->devKey;
    *keyLen = (word32)aes->keylen;
    return 0;
}

#if defined(HAVE_AES_ECB) || defined(WOLFSSL_AES_DIRECT) || \
    defined(WOLF_CRYPTO_CB_ONLY_AES)
/* AES-ECB with a plaintext key. Mirrors Rtl8735bHuk_Ecb but loads the raw key
 * via hal_crypto_aes_ecb_init instead of a HUK-derived slot. Needed so that
 * wc_AesGcmSetKey can derive the GHASH subkey H through the ECB callback under
 * WOLF_CRYPTO_CB_ONLY_AES. Unaligned caller in/out are bounced through
 * 32-byte-aligned temporaries (the HAL DMAs on cache-line boundaries). */
static int Rtl8735bAes_Ecb(const byte* key, word32 keyLen, int enc,
    const byte* in, word32 sz, byte* out)
{
    int         ret = 0;
    const byte* inA  = in;
    byte*       outA = out;
    byte* inBounce  = NULL;
    byte* outBounce = NULL;
    /* The HAL rejects a key that is not 32-byte aligned (it DMAs it), so stage
     * the caller's key (in aes->devKey, unaligned) on an aligned buffer.
     * Zero-initialized so a short (128/192-bit) key leaves no stack residue. */
    XALIGNED(32) byte keyA[WC_RTL8735B_KEYLEN] = { 0 };

    if (key == NULL || in == NULL || out == NULL ||
            sz == 0 || (sz % WC_AES_BLOCK_SIZE) != 0) {
        return BAD_FUNC_ARG;
    }
    if (keyLen > sizeof(keyA)) {
        return BAD_FUNC_ARG;   /* checked before the HW lock (needs nothing) */
    }
    if (sz > WC_RTL8735B_BOUNCE_MAX) {
        return BAD_FUNC_ARG;   /* guard the (sz + 31) bounce allocation */
    }
    ret = Rtl8735b_BounceIn(in, sz, &inA, &inBounce);
    if (ret != 0) {
        return ret;
    }
    if (!WC_RTL8735B_IS_ALIGNED32(out)) {
        ret = Rtl8735b_BounceOut(sz, &outA, &outBounce);
        if (ret != 0) {
            goto cleanup;
        }
    }

    ret = wolfSSL_CryptHwMutexLock();
    if (ret != 0) {
        goto cleanup;
    }
    XMEMCPY(keyA, key, keyLen);
    if (hal_crypto_aes_ecb_init(keyA, keyLen) != 0) {
        ret = WC_HW_E;
        goto unlock;
    }
    if (enc) {
        ret = hal_crypto_aes_ecb_encrypt(inA, sz, NULL, 0, outA);
    }
    else {
        ret = hal_crypto_aes_ecb_decrypt(inA, sz, NULL, 0, outA);
    }
    if (ret != 0) {
        ret = WC_HW_E;
    }
    else if (outBounce != NULL) {
        XMEMCPY(out, outA, sz);
    }

unlock:
    wolfSSL_CryptHwMutexUnLock();
cleanup:
    ForceZero(keyA, sizeof(keyA));                   /* scrub staged key */
    Rtl8735b_BounceFree(inBounce, (byte*)inA, sz);   /* scrub + free (plaintext) */
    Rtl8735b_BounceFree(outBounce, outA, sz);
    return ret;
}
#endif /* HAVE_AES_ECB || WOLFSSL_AES_DIRECT || WOLF_CRYPTO_CB_ONLY_AES */

#ifdef HAVE_AESGCM
/* AES-GCM (encrypt or decrypt-verify) with a plaintext key. Mirrors
 * Rtl8735bHuk_Gcm but loads the raw key via hal_crypto_aes_gcm_init instead of
 * deriving a HUK slot key. Because the key is literal, anything the engine
 * cannot service is declined with CRYPTOCB_UNAVAILABLE so wolfCrypt runs the
 * software GCM under the very same key: a 96-bit (12-byte) IV is all the HAL
 * accepts (standard J0), and see the payload-shape guards below. This is the
 * opposite of the HUK device, where such a fallback would silently key off the
 * seed -- there they are hard errors. */
static int Rtl8735bAes_Gcm(const byte* key, word32 keyLen, int enc,
    const byte* in, word32 sz, byte* out, const byte* iv, word32 ivSz,
    const byte* aad, word32 aadSz, byte* tag, word32 tagSz)
{
    int   ret;
    int   hw;
    XALIGNED(32) byte ivA[WC_AES_BLOCK_SIZE]   = { 0 };
    XALIGNED(32) byte hwTag[WC_AES_BLOCK_SIZE] = { 0 };
    /* The HAL rejects a key that is not 32-byte aligned (it DMAs it), so stage
     * the caller's key (in aes->devKey, unaligned) on an aligned buffer.
     * Zero-initialized so a short (128/192-bit) key leaves no stack residue. */
    XALIGNED(32) byte keyA[WC_RTL8735B_KEYLEN] = { 0 };
    const byte* inA  = in;       /* aligned views; bounced below if needed */
    const byte* aadA = aad;
    byte*       outA = out;
    byte* inBounce  = NULL;
    byte* outBounce = NULL;
    byte* aadBounce = NULL;

    if (key == NULL || iv == NULL) {
        return BAD_FUNC_ARG;
    }
    if (sz > 0 && (in == NULL || out == NULL)) {
        return BAD_FUNC_ARG;
    }
    if (aadSz > 0 && aad == NULL) {
        return BAD_FUNC_ARG;
    }
    if (ivSz != GCM_NONCE_MID_SZ) {
        /* 12-byte IV only on the HW path; decline so software GCM (same
         * literal key) can serve other IV lengths. */
        return CRYPTOCB_UNAVAILABLE;
    }
    if (tag == NULL || tagSz == 0 || tagSz > WC_AES_BLOCK_SIZE) {
        return BAD_FUNC_ARG;
    }
    if (sz > WC_RTL8735B_BOUNCE_MAX || aadSz > WC_RTL8735B_BOUNCE_MAX) {
        return BAD_FUNC_ARG;   /* guard the (sz/aadSz + 31) bounce allocation */
    }
    /* Three payload shapes the engine cannot service. Decline them (rather than
     * letting the HAL fail and surface as WC_HW_E) so wolfCrypt falls back to
     * the software GCM:
     *   - a payload that is not a whole number of AES blocks: the HAL rejects
     *     it outright (-14), and GCM cannot be split across providers;
     *   - AAD longer than the engine's header FIFO (-10);
     *   - an empty payload (GMAC): the HAL returns SUCCESS *without* computing
     *     a tag, which would silently emit an all-zero tag on encrypt and fail
     *     every decrypt. Worse than an error, so it must never reach the HAL. */
    if (sz == 0 || (sz % WC_AES_BLOCK_SIZE) != 0) {
        return CRYPTOCB_UNAVAILABLE;
    }
    if (aadSz > WC_RTL8735B_MAX_AAD) {
        return CRYPTOCB_UNAVAILABLE;
    }

    /* Bounce any unaligned DMA buffer through a 32-byte-aligned temporary. */
    XMEMCPY(ivA, iv, GCM_NONCE_MID_SZ);
    ret = Rtl8735b_BounceIn(aad, aadSz, &aadA, &aadBounce);
    if (ret != 0) {
        goto cleanup;
    }
    ret = Rtl8735b_BounceIn(in, sz, &inA, &inBounce);
    if (ret != 0) {
        goto cleanup;
    }
    /* sz is a non-zero block multiple here (checked above). */
    if (!WC_RTL8735B_IS_ALIGNED32(out)) {
        ret = Rtl8735b_BounceOut(sz, &outA, &outBounce);
        if (ret != 0) {
            goto cleanup;
        }
    }

    if (keyLen > sizeof(keyA)) {
        ret = BAD_FUNC_ARG;
        goto cleanup;   /* frees the in/out/aad bounces already allocated */
    }

    ret = wolfSSL_CryptHwMutexLock();
    if (ret != 0) {
        goto cleanup;
    }
    XMEMCPY(keyA, key, keyLen);
    hw = hal_crypto_aes_gcm_init(keyA, keyLen);
    if (hw != 0) {
        WC_RTL8735B_HW_FAIL("aes_gcm_init", hw);
        ret = WC_HW_E;
        goto unlock;
    }
    if (enc) {
        hw = hal_crypto_aes_gcm_encrypt(inA, sz, ivA, aadA, aadSz, outA,
                                        hwTag);
        if (hw != 0) {
            WC_RTL8735B_HW_FAIL("aes_gcm_encrypt", hw);
            ret = WC_HW_E;
            goto unlock;
        }
        XMEMCPY(tag, hwTag, tagSz);
        ret = 0;
    }
    else {
        hw = hal_crypto_aes_gcm_decrypt(inA, sz, ivA, aadA, aadSz, outA,
                                        hwTag);
        if (hw != 0) {
            WC_RTL8735B_HW_FAIL("aes_gcm_decrypt", hw);
            ret = WC_HW_E;
            goto unlock;
        }
        if (ConstantCompare(hwTag, tag, (int)tagSz) != 0) {
            ForceZero(outA, sz);
            if (outBounce != NULL) {
                ForceZero(out, sz);
            }
            ret = AES_GCM_AUTH_E;
        }
        else {
            ret = 0;
        }
    }
    if (ret == 0 && outBounce != NULL) {
        XMEMCPY(out, outA, sz);
    }

unlock:
    ForceZero(hwTag, sizeof(hwTag));
    wolfSSL_CryptHwMutexUnLock();
cleanup:
    /* Scrub the staged key + each bounce (aligned views hold key/plaintext/AAD). */
    ForceZero(keyA, sizeof(keyA));
    Rtl8735b_BounceFree(inBounce, (byte*)inA, sz);
    Rtl8735b_BounceFree(outBounce, outA, sz);
    Rtl8735b_BounceFree(aadBounce, (byte*)aadA, aadSz);
    return ret;
}
#endif /* HAVE_AESGCM */

