wolfSSL/wolfssl/wolfcrypt/src/port/realtek/rtl8735b.c
/* Cipher dispatch for the plaintext-key device: AES-ECB and AES-GCM run on the
 * HW engine with the caller's key. Unsupported modes return CRYPTOCB_UNAVAILABLE
 * so the caller falls back to software with the same plaintext key (correct
 * here, unlike the HUK device which must hard-fail to avoid using a seed as a
 * raw key). */
static int Rtl8735bAes_Cipher(struct wc_CryptoInfo* info)
{
    int         ret;
    const byte* key = NULL;
    word32      keyLen = 0;

    /* Unused only in the build where neither the ECB nor the GCM case below is
     * compiled in (no cipher modes enabled). */
    (void)ret;
    (void)key;
    (void)keyLen;
    switch (info->cipher.type) {
#if defined(HAVE_AES_ECB) || defined(WOLFSSL_AES_DIRECT) || \
    defined(WOLF_CRYPTO_CB_ONLY_AES)
    case WC_CIPHER_AES_ECB:
        ret = Rtl8735bAes_Key(info->cipher.aesecb.aes, &key, &keyLen);
        if (ret != 0) {
            return ret;
        }
        return Rtl8735bAes_Ecb(key, keyLen, info->cipher.enc,
                               info->cipher.aesecb.in, info->cipher.aesecb.sz,
                               info->cipher.aesecb.out);
#endif
#ifdef HAVE_AESGCM
    case WC_CIPHER_AES_GCM:
        if (info->cipher.enc) {
            ret = Rtl8735bAes_Key(info->cipher.aesgcm_enc.aes, &key, &keyLen);
            if (ret != 0) {
                return ret;
            }
            return Rtl8735bAes_Gcm(key, keyLen, 1,
                                   info->cipher.aesgcm_enc.in,
                                   info->cipher.aesgcm_enc.sz,
                                   info->cipher.aesgcm_enc.out,
                                   info->cipher.aesgcm_enc.iv,
                                   info->cipher.aesgcm_enc.ivSz,
                                   info->cipher.aesgcm_enc.authIn,
                                   info->cipher.aesgcm_enc.authInSz,
                                   info->cipher.aesgcm_enc.authTag,
                                   info->cipher.aesgcm_enc.authTagSz);
        }
        else {
            ret = Rtl8735bAes_Key(info->cipher.aesgcm_dec.aes, &key, &keyLen);
            if (ret != 0) {
                return ret;
            }
            /* authTag is const (input-only on decrypt); Rtl8735bAes_Gcm reads it
             * via ConstantCompare and never writes it on the decrypt path, so
             * dropping const here is safe. */
            return Rtl8735bAes_Gcm(key, keyLen, 0,
                                   info->cipher.aesgcm_dec.in,
                                   info->cipher.aesgcm_dec.sz,
                                   info->cipher.aesgcm_dec.out,
                                   info->cipher.aesgcm_dec.iv,
                                   info->cipher.aesgcm_dec.ivSz,
                                   info->cipher.aesgcm_dec.authIn,
                                   info->cipher.aesgcm_dec.authInSz,
                                   (byte*)info->cipher.aesgcm_dec.authTag,
                                   info->cipher.aesgcm_dec.authTagSz);
        }
#endif
    default:
        return CRYPTOCB_UNAVAILABLE;
    }
}

/* Crypto-callback entry point for the plaintext-key AES device. */
static int Rtl8735bAes_CryptoDevCb(int devId, struct wc_CryptoInfo* info,
    void* ctx)
{
    (void)devId;
    (void)ctx;
    if (info == NULL) {
        return CRYPTOCB_UNAVAILABLE;
    }
    if (info->algo_type == WC_ALGO_TYPE_CIPHER) {
        return Rtl8735bAes_Cipher(info);
    }
    return CRYPTOCB_UNAVAILABLE;
}

/* Register the plaintext-key AES device at devId (e.g. WC_RTL8735B_AES_DEVID).
 * Objects whose devId is set to it at init run AES on the HW engine with their
 * own key. Independent of the HUK device, so both can be active at once and are
 * selected per-Aes by devId. */
int wc_Rtl8735b_AesRegister(int devId)
{
    int ret = Rtl8735bHuk_Init(NULL);   /* shared HW engine bring-up */
    if (ret != 0) {
        return ret;
    }
    return wc_CryptoCb_RegisterDevice(devId, Rtl8735bAes_CryptoDevCb, NULL);
}

int wc_Rtl8735b_AesUnRegister(int devId)
{
    wc_CryptoCb_UnRegisterDevice(devId);
    return 0;
}

#ifdef WOLFSSL_RTL8735B_HOST_TEST
/* Host self-test of the plaintext-key AES device. The stub HAL performs no real
 * crypto, so this cannot check ciphertext -- it validates that each supported
 * operation reaches the device and returns cleanly, that the unaligned bounce
 * path runs, and that the sz==0 GMAC path is handled. Returns 0 on success or a
 * negative code identifying the first failing check. */
int wc_Rtl8735b_AesSelfTest(void)
{
    Aes  aes;
    int  ret;
    byte key[WC_RTL8735B_KEYLEN];
    byte in[WC_AES_BLOCK_SIZE];
    byte out[WC_AES_BLOCK_SIZE];
#ifdef HAVE_AESGCM
    byte iv[GCM_NONCE_MID_SZ];
    byte tag[WC_AES_BLOCK_SIZE];
    byte aad[WC_AES_BLOCK_SIZE];
    byte inU[WC_AES_BLOCK_SIZE + 4];
    byte outU[WC_AES_BLOCK_SIZE + 4];
#endif

    XMEMSET(&aes, 0, sizeof(aes));   /* so a failed wc_AesInit leaves it sane */
    XMEMSET(key, 0x11, sizeof(key));
    XMEMSET(in,  0x33, sizeof(in));
#ifdef HAVE_AESGCM
    XMEMSET(iv,  0x22, sizeof(iv));
    XMEMSET(aad, 0x44, sizeof(aad));
    XMEMSET(inU, 0x55, sizeof(inU));
#endif

    ret = wc_Rtl8735b_AesRegister(WC_RTL8735B_AES_DEVID);
    if (ret != 0) {
        return -1;
    }

#if defined(HAVE_AES_ECB) || defined(WOLFSSL_AES_DIRECT) || \
    defined(WOLF_CRYPTO_CB_ONLY_AES)
    /* AES-ECB (256-bit) dispatch. */
    ret = wc_AesInit(&aes, NULL, WC_RTL8735B_AES_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, key, WC_RTL8735B_KEYLEN, NULL, AES_ENCRYPTION);
        if (ret == 0) {
            ret = wc_AesEcbEncrypt(&aes, out, in, WC_AES_BLOCK_SIZE);
        }
        wc_AesFree(&aes);
    }
    if (ret != 0) {
        wc_Rtl8735b_AesUnRegister(WC_RTL8735B_AES_DEVID);
        return -2;
    }
#else
    (void)out;
#endif

#ifdef HAVE_AESGCM
    /* AES-GCM: aligned whole block, then sz==0 GMAC, then an unaligned view. */
    ret = wc_AesInit(&aes, NULL, WC_RTL8735B_AES_DEVID);
    if (ret == 0) {
        ret = wc_AesGcmSetKey(&aes, key, WC_RTL8735B_KEYLEN);
        if (ret == 0) {
            ret = wc_AesGcmEncrypt(&aes, out, in, WC_AES_BLOCK_SIZE,
                                   iv, sizeof(iv), tag, sizeof(tag), NULL, 0);
        }
        if (ret == 0) {
            ret = wc_AesGcmEncrypt(&aes, NULL, NULL, 0, iv, sizeof(iv),
                                   tag, sizeof(tag), aad, sizeof(aad));
        }
        if (ret == 0) {
            /* inU+1 / outU+1 are not 32-byte aligned -> exercise the bounce
             * path. */
            ret = wc_AesGcmEncrypt(&aes, outU + 1, inU + 1, WC_AES_BLOCK_SIZE,
                                   iv, sizeof(iv), tag, sizeof(tag), NULL, 0);
        }
        wc_AesFree(&aes);
    }
    if (ret != 0) {
        wc_Rtl8735b_AesUnRegister(WC_RTL8735B_AES_DEVID);
        return -3;
    }
#endif

    wc_Rtl8735b_AesUnRegister(WC_RTL8735B_AES_DEVID);
    return 0;
}
#endif /* WOLFSSL_RTL8735B_HOST_TEST */
#endif /* WOLFSSL_RTL8735B_AES && !NO_AES */

#ifdef WOLFSSL_RTL8735B_HUK

/* Run the HUK key-ladder on the per-operation seed (the 32-byte HKDF input the
 * Aes carries in devKey): HUK (secure key slot) -> HKDF-Extract(secure) -> PRK
 * slot -> HKDF-Expand(secure) -> device-bound working key in the derived slot.
 * The working key never enters software; on return it resides in
 * WC_RTL8735B_DERIVED_WB_IDX, ready for an AES *_sk_init that references that
 * slot. The seed is passed by argument (not held in a global), so concurrent
 * Aes objects never race; the caller holds the crypto mutex across derive + op.
 *
 * The HUK is the built-in secure key at slot WC_RTL8735B_HUK_SK_IDX (HUK1); the
 * engine reads it internally. We deliberately do NOT lock the derived slot: each
 * operation re-derives the working key into it, and a locked key-storage slot
 * silently rejects that re-derivation (it would keep a stale key, so a different
 * seed would yield the wrong result). The slot is overwritten on the next
 * derive; nothing reads it back into software. */
static int Rtl8735bHuk_DeriveSlotKey(const byte* seed)
{
    XALIGNED(32) byte seedA[WC_RTL8735B_KEYLEN];

