wolfSSL/wolfssl/wolfcrypt/src/port/realtek/rtl8735b.c
    if (seed == NULL) {
        return BAD_FUNC_ARG;
    }
#ifndef WC_RTL8735B_NO_DERIVE_CACHE
    /* If the derived slot already holds the working key for this exact seed,
     * skip the (two secure HMAC-SHA256 ops) HKDF ladder and reuse the slot. */
    if (huk_haveCache &&
            ConstantCompare(huk_seedCache, seed, WC_RTL8735B_KEYLEN) == 0) {
        return 0;
    }
    /* A fresh derive is starting; invalidate the cache until it succeeds so a
     * mid-ladder failure never leaves the cache claiming a stale slot. */
    huk_haveCache = 0;
#endif
    /* HKDF reads the seed via DMA -- pass it a 32-byte-aligned copy. */
    XMEMCPY(seedA, seed, WC_RTL8735B_KEYLEN);

    /* Init the secure HKDF HMAC-SHA256 engine (sets isHWCrypto_Init); required
     * before any *_secure_all call or extract returns HW_NOT_INIT. */
    if (hal_hkdf_hmac_sha256_secure_init((u8)WC_RTL8735B_HKDF_CRYPTO_SEL)
            != HAL_OK) {
        return WC_HW_E;
    }
    /* HKDF-Extract: PRK = HMAC(HUK, seed), into the PRK slot. */
    if (hal_hkdf_extract_secure_all((u8)WC_RTL8735B_HUK_SK_IDX,
            (u8)WC_RTL8735B_HKDF_PRK_IDX, seedA) != HAL_OK) {
        return WC_HW_E;
    }
    /* HKDF-Expand: OKM = working key, into the derived working-key slot. */
    if (hal_hkdf_expand_secure_all((u8)WC_RTL8735B_HKDF_PRK_IDX,
            (u8)WC_RTL8735B_DERIVED_WB_IDX, seedA) != HAL_OK) {
        return WC_HW_E;
    }
#ifndef WC_RTL8735B_NO_DERIVE_CACHE
    /* Slot now holds the working key for this seed; remember it. */
    XMEMCPY(huk_seedCache, seed, WC_RTL8735B_KEYLEN);
    huk_haveCache = 1;
#endif
    return 0;
}

#ifndef NO_AES

#ifdef HAVE_AESGCM
/* Full AES-GCM (encrypt or decrypt-verify) under a HUK-derived slot key. The HAL
 * assumes a 96-bit (12-byte) IV (standard J0); an unsupported IV length is a hard
 * BAD_FUNC_ARG. Do NOT return NOT_COMPILED_IN here -- the crypto-cb layer rewrites
 * it to CRYPTOCB_UNAVAILABLE, forcing an unwanted software GCM that would key off
 * the seed, not the device-bound key. */
static int Rtl8735bHuk_Gcm(int enc, const byte* seed, const byte* in,
    word32 sz, byte* out, const byte* iv, word32 ivSz, const byte* aad,
    word32 aadSz, byte* tag, word32 tagSz)
{
    int   ret;
    int   hw;
    /* 16-byte aligned IV block: the HAL reads a full block, so the 4 bytes past
     * the 12-byte nonce must be zero and stable across calls. */
    XALIGNED(32) byte ivA[WC_AES_BLOCK_SIZE]   = { 0 };
    XALIGNED(32) byte hwTag[WC_AES_BLOCK_SIZE] = { 0 };
    const byte* inA  = in;       /* aligned views; bounced below if needed */
    const byte* aadA = aad;
    byte*       outA = out;
    byte* inBounce  = NULL;
    byte* outBounce = NULL;
    byte* aadBounce = NULL;

    /* Validate args before any copy/bounce/dereference: the crypto-callback
     * wrapper does not, so a bad caller would otherwise crash inside the HAL. */
    if (seed == NULL || iv == NULL) {
        return BAD_FUNC_ARG;
    }
    if (sz > 0 && (in == NULL || out == NULL)) {
        return BAD_FUNC_ARG;
    }
    if (aadSz > 0 && aad == NULL) {
        return BAD_FUNC_ARG;
    }
    if (ivSz != GCM_NONCE_MID_SZ) {
        /* 12-byte IV only; hard error, NOT NOT_COMPILED_IN (see header). */
        return BAD_FUNC_ARG;
    }
    if (tag == NULL || tagSz == 0 || tagSz > WC_AES_BLOCK_SIZE) {
        return BAD_FUNC_ARG;
    }
    if (sz > WC_RTL8735B_BOUNCE_MAX || aadSz > WC_RTL8735B_BOUNCE_MAX) {
        return BAD_FUNC_ARG;   /* guard the (sz/aadSz + 31) bounce allocation */
    }
    /* Three payload shapes the engine cannot service. On THIS device they must
     * fail, not decline: CRYPTOCB_UNAVAILABLE (and NOT_COMPILED_IN, which the
     * crypto-cb layer rewrites to it) sends wolfCrypt into the software GCM,
     * and here the Aes key bytes are the HUK *seed*, not a key -- software
     * would encrypt and authenticate under the seed sitting in application RAM
     * instead of the device-bound slot key that never leaves hardware. Fail
     * closed, exactly as the ivSz check above and Rtl8735bHuk_Ecb/Cbc do. The
     * identical guards on the plaintext-key device (Rtl8735bAes_Gcm) DO
     * decline, because there the software fallback uses the same literal key.
     *   - a payload that is not a whole number of AES blocks: the HAL rejects
     *     it outright (-14), and GCM cannot be split across providers;
     *   - AAD longer than the engine's header FIFO (-10);
     *   - an empty payload (GMAC): the HAL returns SUCCESS *without* computing
     *     a tag, which would silently emit an all-zero tag on encrypt and fail
     *     every decrypt. Worse than an error, so it must never reach the HAL. */
    if (sz == 0 || (sz % WC_AES_BLOCK_SIZE) != 0) {
        return BAD_FUNC_ARG;
    }
    if (aadSz > WC_RTL8735B_MAX_AAD) {
        return BAD_FUNC_ARG;
    }

    /* Bounce any unaligned DMA buffer through a 32-byte-aligned temporary. iv
     * and tag are small and always staged on aligned stack buffers; in/out/aad
     * may be large, so are only copied when actually unaligned. */
    XMEMCPY(ivA, iv, GCM_NONCE_MID_SZ);
    ret = Rtl8735b_BounceIn(aad, aadSz, &aadA, &aadBounce);
    if (ret != 0) {
        goto cleanup;
    }
    ret = Rtl8735b_BounceIn(in, sz, &inA, &inBounce);
    if (ret != 0) {
        goto cleanup;
    }
    /* sz is a non-zero block multiple here (checked above). */
    if (!WC_RTL8735B_IS_ALIGNED32(out)) {
        ret = Rtl8735b_BounceOut(sz, &outA, &outBounce);
        if (ret != 0) {
            goto cleanup;
        }
    }

    ret = wolfSSL_CryptHwMutexLock();
    if (ret != 0) {
        goto cleanup;
    }
    ret = Rtl8735bHuk_DeriveSlotKey(seed);
    if (ret != 0) {
        goto unlock;
    }
    hw = hal_crypto_aes_gcm_sk_init((byte)WC_RTL8735B_DERIVED_WB_IDX,
                                    WC_RTL8735B_KEYLEN);
    if (hw != 0) {
        WC_RTL8735B_HW_FAIL("aes_gcm_sk_init", hw);
        ret = WC_HW_E;
        goto unlock;
    }
    if (enc) {
        hw = hal_crypto_aes_gcm_encrypt(inA, sz, ivA, aadA, aadSz, outA,
                                        hwTag);
        if (hw != 0) {
            WC_RTL8735B_HW_FAIL("aes_gcm_encrypt", hw);
            ret = WC_HW_E;
            goto unlock;
        }
        XMEMCPY(tag, hwTag, tagSz);
        ret = 0;
    }
    else {
        hw = hal_crypto_aes_gcm_decrypt(inA, sz, ivA, aadA, aadSz, outA,
                                        hwTag);
        if (hw != 0) {
            WC_RTL8735B_HW_FAIL("aes_gcm_decrypt", hw);
            ret = WC_HW_E;
            goto unlock;
        }
        if (ConstantCompare(hwTag, tag, (int)tagSz) != 0) {
            ForceZero(outA, sz);
            /* When out was bounced, outA is the heap bounce; also clear the
             * caller's out so the zero-on-auth-fail contract holds for the
             * unaligned (incl. in-place) case. */
            if (outBounce != NULL) {
                ForceZero(out, sz);
            }
            ret = AES_GCM_AUTH_E;
        }
        else {
            ret = 0;
        }
    }
    if (ret == 0 && outBounce != NULL) {
        XMEMCPY(out, outA, sz);
    }

unlock:
    ForceZero(hwTag, sizeof(hwTag));
    wolfSSL_CryptHwMutexUnLock();
cleanup:
    /* Scrub + free each bounce (the aligned views hold plaintext / AAD). */
    Rtl8735b_BounceFree(inBounce, (byte*)inA, sz);
    Rtl8735b_BounceFree(outBounce, outA, sz);
    Rtl8735b_BounceFree(aadBounce, (byte*)aadA, aadSz);
    return ret;
}
#endif /* HAVE_AESGCM */

#if defined(HAVE_AES_ECB) || defined(WOLFSSL_AES_DIRECT) || \
    defined(WOLF_CRYPTO_CB_ONLY_AES)
/* AES-ECB under a HUK-derived slot key. sz must be a multiple of the block.
 * Unaligned caller in/out are bounced through 32-byte-aligned temporaries (the
 * HAL DMAs its buffers on cache-line boundaries), so callers need not align.
 * Guarded to match its only call site (the WC_CIPHER_AES_ECB dispatch case);
 * CBC/CTR drive hal_crypto_aes_ecb_* directly, not this helper. */
static int Rtl8735bHuk_Ecb(int enc, const byte* seed, const byte* in,
    word32 sz, byte* out)
{
    int         ret = 0;
    const byte* inA  = in;
    byte*       outA = out;
    byte* inBounce  = NULL;
    byte* outBounce = NULL;

    if (seed == NULL || in == NULL || out == NULL ||
            sz == 0 || (sz % WC_AES_BLOCK_SIZE) != 0) {
        return BAD_FUNC_ARG;
    }
    if (sz > WC_RTL8735B_BOUNCE_MAX) {
        return BAD_FUNC_ARG;   /* guard the (sz + 31) bounce allocation */
    }
    ret = Rtl8735b_BounceIn(in, sz, &inA, &inBounce);
    if (ret != 0) {
        return ret;
    }
    if (!WC_RTL8735B_IS_ALIGNED32(out)) {
        ret = Rtl8735b_BounceOut(sz, &outA, &outBounce);
        if (ret != 0) {
            goto cleanup;
        }
    }

    ret = wolfSSL_CryptHwMutexLock();
    if (ret != 0) {
        goto cleanup;
    }
    ret = Rtl8735bHuk_DeriveSlotKey(seed);
    if (ret != 0) {
        goto unlock;
    }
    if (hal_crypto_aes_ecb_sk_init((byte)WC_RTL8735B_DERIVED_WB_IDX,
            WC_RTL8735B_KEYLEN) != 0) {
        ret = WC_HW_E;
        goto unlock;
    }
    if (enc) {
        ret = hal_crypto_aes_ecb_encrypt(inA, sz, NULL, 0, outA);
    }
    else {
        ret = hal_crypto_aes_ecb_decrypt(inA, sz, NULL, 0, outA);
    }
    if (ret != 0) {
        ret = WC_HW_E;
    }
    else if (outBounce != NULL) {
        XMEMCPY(out, outA, sz);
    }

unlock:
    wolfSSL_CryptHwMutexUnLock();
cleanup:
    Rtl8735b_BounceFree(inBounce, (byte*)inA, sz);   /* scrub + free (plaintext) */
    Rtl8735b_BounceFree(outBounce, outA, sz);
    return ret;
}
#endif /* HAVE_AES_ECB || WOLFSSL_AES_DIRECT || WOLF_CRYPTO_CB_ONLY_AES */

#ifdef HAVE_AES_CBC
/* AES-CBC under a HUK-derived slot key. The HAL has no CBC secure-key variant
 * (only ECB/GCM expose *_sk_init), so chain in software over single-block
 * ECB-sk operations -- the key still never leaves hardware. iv is the 16-byte
 * chaining block (aes->reg); on success it is advanced to the last ciphertext
 * block for the next call. Handles in == out (in-place) for both directions. */
static int Rtl8735bHuk_Cbc(int enc, const byte* seed, const byte* in,
    word32 sz, byte* out, byte* iv)
{
    int    ret;
    word32 off;
    XALIGNED(32) byte prev[WC_AES_BLOCK_SIZE];
    XALIGNED(32) byte blk[WC_AES_BLOCK_SIZE];
    XALIGNED(32) byte cur[WC_AES_BLOCK_SIZE];

    if (seed == NULL || in == NULL || out == NULL || iv == NULL ||
            sz == 0 || (sz % WC_AES_BLOCK_SIZE) != 0) {
        return BAD_FUNC_ARG;
    }
    ret = wolfSSL_CryptHwMutexLock();
    if (ret != 0) {
        return ret;
    }
    ret = Rtl8735bHuk_DeriveSlotKey(seed);
    if (ret != 0) {
        goto out;
    }
    if (hal_crypto_aes_ecb_sk_init((byte)WC_RTL8735B_DERIVED_WB_IDX,
            WC_RTL8735B_KEYLEN) != 0) {
        ret = WC_HW_E;
        goto out;
    }

    XMEMCPY(prev, iv, WC_AES_BLOCK_SIZE);
    for (off = 0; off < sz; off += WC_AES_BLOCK_SIZE) {
        if (enc) {
            /* C_i = ECB_enc(P_i XOR C_{i-1}). The HAL DMAs its output on a
             * 32-byte boundary, so encrypt into the aligned temp cur, then copy
             * to the (possibly unaligned) out+off. Reads in+off before writing
             * out+off, so in-place (out == in) is safe. */
            xorbufout(blk, in + off, prev, WC_AES_BLOCK_SIZE);
            ret = hal_crypto_aes_ecb_encrypt(blk, WC_AES_BLOCK_SIZE, NULL, 0,
                                             cur);
            if (ret != 0) {
                ret = WC_HW_E;
                goto out;
            }
            XMEMCPY(out + off, cur, WC_AES_BLOCK_SIZE);
            XMEMCPY(prev, cur, WC_AES_BLOCK_SIZE);
        }
        else {
            /* P_i = ECB_dec(C_i) XOR C_{i-1}. Save C_i first: writing out+off
             * below would clobber it when out == in, and it is the next call's
             * chaining value. */
            XMEMCPY(cur, in + off, WC_AES_BLOCK_SIZE);
            ret = hal_crypto_aes_ecb_decrypt(cur, WC_AES_BLOCK_SIZE, NULL, 0,
                                             blk);
            if (ret != 0) {
                ret = WC_HW_E;
                goto out;
            }
            xorbufout(out + off, blk, prev, WC_AES_BLOCK_SIZE);
            XMEMCPY(prev, cur, WC_AES_BLOCK_SIZE);
        }
    }
    /* Advance the chaining IV to the last ciphertext block (prev holds it for
     * both directions); only on full success. */
    XMEMCPY(iv, prev, WC_AES_BLOCK_SIZE);
    ret = 0;

out:
    ForceZero(prev, sizeof(prev));
    ForceZero(blk, sizeof(blk));
    ForceZero(cur, sizeof(cur));
    wolfSSL_CryptHwMutexUnLock();
    return ret;
}
#endif /* HAVE_AES_CBC */

#ifdef WOLFSSL_AES_COUNTER
/* Increment the 16-byte big-endian counter in place. */
static void Rtl8735bHuk_IncCtr(byte* ctr)
{
    int i;
    for (i = WC_AES_BLOCK_SIZE - 1; i >= 0; i--) {
        if (++ctr[i] != 0) {
            break;
        }
    }
}

/* AES-CTR under a HUK-derived slot key. The HAL has no CTR secure-key variant,
 * so generate the keystream by ECB-sk encrypting the counter and XOR it with the
 * data -- the key never leaves hardware. Maintains the wolfCrypt CTR state:
 * aes->reg (counter), aes->tmp (current keystream block) and aes->left (unused
 * keystream bytes at the tail of aes->tmp) so partial blocks continue across
 * calls exactly as the software path does. The counter is staged on an aligned
 * stack buffer, so caller in/out alignment does not matter (only XORed here). */
static int Rtl8735bHuk_Ctr(Aes* aes, const byte* seed, const byte* in,
    word32 sz, byte* out)
{
    int    ret;
    word32 processed;
    XALIGNED(32) byte ctr[WC_AES_BLOCK_SIZE] = { 0 };
    XALIGNED(32) byte ks[WC_AES_BLOCK_SIZE]  = { 0 };

    if (aes == NULL || seed == NULL ||
            (sz != 0 && (in == NULL || out == NULL))) {
        return BAD_FUNC_ARG;   /* seed check for parity with Gcm/Ecb/Cbc */
    }

