wolfSSL/wolfssl/wolfcrypt/src/port/realtek/rtl8735b.c
    /* If the whole request is covered by leftover keystream, no HW is needed:
     * consume it and return without touching the lock. */
    if (aes->left >= sz) {
        if (sz > 0) {
            xorbufout(out, in,
                      (byte*)aes->tmp + WC_AES_BLOCK_SIZE - aes->left, sz);
            aes->left -= sz;
        }
        return 0;
    }

    /* HW is needed -- take the lock before mutating any state, so a lock failure
     * leaves the CTR state and output untouched. */
    ret = wolfSSL_CryptHwMutexLock();
    if (ret != 0) {
        return ret;
    }

    /* Derive/init the HW key first: a failure here must leave the output and CTR
     * state untouched, so the leftover-keystream consumption (below) only runs
     * once the hardware is ready. */
    ret = Rtl8735bHuk_DeriveSlotKey(seed);
    if (ret != 0) {
        goto out;
    }
    if (hal_crypto_aes_ecb_sk_init((byte)WC_RTL8735B_DERIVED_WB_IDX,
            WC_RTL8735B_KEYLEN) != 0) {
        ret = WC_HW_E;
        goto out;
    }

    /* Now consume any leftover keystream (all of it, since left < sz here). */
    processed = aes->left;
    if (processed > 0) {
        xorbufout(out, in,
                  (byte*)aes->tmp + WC_AES_BLOCK_SIZE - aes->left, processed);
        out += processed;
        in  += processed;
        aes->left = 0;
        sz  -= processed;
    }

    XMEMCPY(ctr, aes->reg, WC_AES_BLOCK_SIZE);
    while (sz >= WC_AES_BLOCK_SIZE) {
        ret = hal_crypto_aes_ecb_encrypt(ctr, WC_AES_BLOCK_SIZE, NULL, 0, ks);
        if (ret != 0) {
            ret = WC_HW_E;
            goto out;
        }
        xorbufout(out, in, ks, WC_AES_BLOCK_SIZE);
        Rtl8735bHuk_IncCtr(ctr);
        out += WC_AES_BLOCK_SIZE;
        in  += WC_AES_BLOCK_SIZE;
        sz  -= WC_AES_BLOCK_SIZE;
    }
    if (sz > 0) {
        /* Final partial block: keep the unused keystream for the next call. */
        ret = hal_crypto_aes_ecb_encrypt(ctr, WC_AES_BLOCK_SIZE, NULL, 0, ks);
        if (ret != 0) {
            ret = WC_HW_E;
            goto out;
        }
        XMEMCPY(aes->tmp, ks, WC_AES_BLOCK_SIZE);
        xorbufout(out, in, ks, sz);
        Rtl8735bHuk_IncCtr(ctr);
        aes->left = WC_AES_BLOCK_SIZE - sz;
    }
    XMEMCPY(aes->reg, ctr, WC_AES_BLOCK_SIZE);
    ret = 0;

out:
    ForceZero(ks, sizeof(ks));
    ForceZero(ctr, sizeof(ctr));
    wolfSSL_CryptHwMutexUnLock();
    return ret;
}
#endif /* WOLFSSL_AES_COUNTER */

/* The 256-bit seed an Aes carries in devKey (set via the normal key API) is the
 * per-operation HKDF input. Point *seed at it, or return CRYPTOCB_UNAVAILABLE if
 * this is not a 256-bit seed key (so non-HUK keys fall back to software). */
static int Rtl8735bHuk_AesSeed(Aes* aes, const byte** seed)
{
    if (aes == NULL || aes->keylen != WC_RTL8735B_KEYLEN) {
        return CRYPTOCB_UNAVAILABLE;
    }
    *seed = (const byte*)aes->devKey;
    return 0;
}

static int Rtl8735bHuk_Cipher(struct wc_CryptoInfo* info)
{
    int ret;
    const byte* seed = NULL;

    switch (info->cipher.type) {
#if defined(HAVE_AES_ECB) || defined(WOLFSSL_AES_DIRECT) || \
    defined(WOLF_CRYPTO_CB_ONLY_AES)
    case WC_CIPHER_AES_ECB:
        ret = Rtl8735bHuk_AesSeed(info->cipher.aesecb.aes, &seed);
        if (ret != 0) {
            return ret;
        }
        return Rtl8735bHuk_Ecb(info->cipher.enc, seed, info->cipher.aesecb.in,
                                info->cipher.aesecb.sz, info->cipher.aesecb.out);
#endif
#if defined(HAVE_AES_CBC)
    case WC_CIPHER_AES_CBC:
        ret = Rtl8735bHuk_AesSeed(info->cipher.aescbc.aes, &seed);
        if (ret != 0) {
            return ret;
        }
        /* Rtl8735bHuk_Cbc advances aes->reg (the chaining IV) itself, correctly
         * for in-place and both directions. */
        return Rtl8735bHuk_Cbc(info->cipher.enc, seed, info->cipher.aescbc.in,
                                info->cipher.aescbc.sz, info->cipher.aescbc.out,
                                (byte*)info->cipher.aescbc.aes->reg);
#endif
#ifdef WOLFSSL_AES_COUNTER
    case WC_CIPHER_AES_CTR:
        ret = Rtl8735bHuk_AesSeed(info->cipher.aesctr.aes, &seed);
        if (ret != 0) {
            return ret;
        }
        return Rtl8735bHuk_Ctr(info->cipher.aesctr.aes, seed,
                                info->cipher.aesctr.in, info->cipher.aesctr.sz,
                                info->cipher.aesctr.out);
#endif
#ifdef HAVE_AESGCM
    case WC_CIPHER_AES_GCM:
        if (info->cipher.enc) {
            ret = Rtl8735bHuk_AesSeed(info->cipher.aesgcm_enc.aes, &seed);
            if (ret != 0) {
                return ret;
            }
            return Rtl8735bHuk_Gcm(1, seed,
                                    info->cipher.aesgcm_enc.in,
                                    info->cipher.aesgcm_enc.sz,
                                    info->cipher.aesgcm_enc.out,
                                    info->cipher.aesgcm_enc.iv,
                                    info->cipher.aesgcm_enc.ivSz,
                                    info->cipher.aesgcm_enc.authIn,
                                    info->cipher.aesgcm_enc.authInSz,
                                    info->cipher.aesgcm_enc.authTag,
                                    info->cipher.aesgcm_enc.authTagSz);
        }
        else {
            ret = Rtl8735bHuk_AesSeed(info->cipher.aesgcm_dec.aes, &seed);
            if (ret != 0) {
                return ret;
            }
            return Rtl8735bHuk_Gcm(0, seed,
                                    info->cipher.aesgcm_dec.in,
                                    info->cipher.aesgcm_dec.sz,
                                    info->cipher.aesgcm_dec.out,
                                    info->cipher.aesgcm_dec.iv,
                                    info->cipher.aesgcm_dec.ivSz,
                                    info->cipher.aesgcm_dec.authIn,
                                    info->cipher.aesgcm_dec.authInSz,
                                    /* authTag is const (input-only on decrypt);
                                     * Rtl8735bHuk_Gcm reads it via ConstantCompare
                                     * and never writes it on the decrypt (enc==0)
                                     * path, so dropping const here is safe. */
                                    (byte*)info->cipher.aesgcm_dec.authTag,
                                    info->cipher.aesgcm_dec.authTagSz);
        }
#endif
    default:
        return CRYPTOCB_UNAVAILABLE;
    }
}
#endif /* !NO_AES */

#if !defined(NO_HMAC) && !defined(NO_SHA256)
/* HUK-bound HMAC-SHA256 over a secure-key slot. wc_HmacUpdate is incremental but
 * the HAL sk_init->update->sk_final state cannot span those calls under one mutex
 * hold, so the message is accumulated into a heap buffer and MAC'd one-shot at
 * final (suits short HUK MAC / KDF use). The buffer hangs off the inner SHA-256
 * devCtx, NOT hmac->devCtx: the latter has no cryptocb copy/free op and
 * wc_HmacCopy aliases it (-> double free); the SHA-256 devCtx fires
 * WC_ALGO_TYPE_COPY/FREE so the buffer is deep-copied and freed once. Needs
 * WOLF_CRYPTO_CB_COPY + WOLF_CRYPTO_CB_FREE. */
#if !defined(WOLF_CRYPTO_CB_COPY) || !defined(WOLF_CRYPTO_CB_FREE)
    #error "RTL8735B HUK HMAC needs WOLF_CRYPTO_CB_COPY and WOLF_CRYPTO_CB_FREE"
#endif
typedef struct Rtl8735bHmacCtx {
    byte*  buf;
    word32 len;
    word32 cap;
} Rtl8735bHmacCtx;

