wolfSSL/wolfssl/wolfcrypt/src/port/realtek/rtl8735b.c
/* Free the accumulation buffer + ctx hung off a SHA-256 context's devCtx (the
 * WC_ALGO_TYPE_FREE handler, and the one-shot free after Final). No-op if none. */
static void Rtl8735bHuk_HmacFreeSha(wc_Sha256* sha)
{
    Rtl8735bHmacCtx* ctx;
    if (sha == NULL) {
        return;
    }
    ctx = (Rtl8735bHmacCtx*)sha->devCtx;
    if (ctx != NULL) {
        if (ctx->buf != NULL) {
            ForceZero(ctx->buf, ctx->cap);   /* cleartext message material */
            XFREE(ctx->buf, sha->heap, DYNAMIC_TYPE_HMAC);
        }
        XFREE(ctx, sha->heap, DYNAMIC_TYPE_HMAC);
        sha->devCtx = NULL;
    }
}

/* Deep-copy the accumulation buffer from src's SHA-256 devCtx to dst's (the
 * WC_ALGO_TYPE_COPY handler). wc_Sha256Copy has already shallow-copied
 * dst->devCtx = src->devCtx (an alias); replace it with an owned copy. */
static int Rtl8735bHuk_HmacCopySha(wc_Sha256* src, wc_Sha256* dst)
{
    Rtl8735bHmacCtx* s;
    Rtl8735bHmacCtx* d;

    if (src == NULL || dst == NULL) {
        return BAD_FUNC_ARG;
    }
    /* wc_Sha256Copy returns as soon as this handler returns 0, skipping the struct
     * copy that carries devId/heap (wc_HmacCopy has zeroed dst->hash). Carry them
     * over so a later copy/free of dst routes back here (else free misroutes and
     * leaks); set heap before the XMALLOCs. */
    dst->devId = src->devId;
    dst->heap  = src->heap;
    s = (Rtl8735bHmacCtx*)src->devCtx;
    if (s == NULL) {
        dst->devCtx = NULL;              /* nothing accumulated on src */
        return 0;
    }
    d = (Rtl8735bHmacCtx*)XMALLOC(sizeof(Rtl8735bHmacCtx), dst->heap,
                                  DYNAMIC_TYPE_HMAC);
    if (d == NULL) {
        dst->devCtx = NULL;              /* drop the alias; do not free src's */
        return MEMORY_E;
    }
    d->len = s->len;
    d->cap = s->len;                     /* copy exactly what is used */
    d->buf = NULL;
    if (s->len > 0) {
        d->buf = (byte*)XMALLOC(s->len, dst->heap, DYNAMIC_TYPE_HMAC);
        if (d->buf == NULL) {
            XFREE(d, dst->heap, DYNAMIC_TYPE_HMAC);
            dst->devCtx = NULL;
            return MEMORY_E;
        }
        XMEMCPY(d->buf, s->buf, s->len);
    }
    dst->devCtx = d;
    return 0;
}

/* Append a message chunk to the accumulation buffer (grown geometric), stored on
 * the inner SHA-256 devCtx. On allocation failure the partial buffer is released
 * by the SHA-256 free op (WC_ALGO_TYPE_FREE) at wc_HmacFree. */
static int Rtl8735bHuk_HmacAccumulate(Hmac* hmac, const byte* in, word32 inSz)
{
    wc_Sha256* sha = &hmac->hash.sha256;
    Rtl8735bHmacCtx* ctx;
    byte*  nb;
    word32 need;
    word32 newCap;
    word32 dbl;

    if (inSz == 0) {
        return 0;
    }
    if (in == NULL) {
        return BAD_FUNC_ARG;
    }
    ctx = (Rtl8735bHmacCtx*)sha->devCtx;
    if (ctx == NULL) {
        /* DYNAMIC_TYPE_HMAC, not _TMP_BUFFER: this context + its growing buffer
         * live across Update calls until Final/Free, not within one call. */
        ctx = (Rtl8735bHmacCtx*)XMALLOC(sizeof(Rtl8735bHmacCtx), sha->heap,
                                         DYNAMIC_TYPE_HMAC);
        if (ctx == NULL) {
            return MEMORY_E;
        }
        ctx->buf = NULL;
        ctx->len = 0;
        ctx->cap = 0;
        sha->devCtx = ctx;
    }
    need = ctx->len + inSz;
    if (need < ctx->len) {              /* word32 overflow */
        return BUFFER_E;
    }
#ifdef WC_RTL8735B_HMAC_MAX_MSG
    /* Optional misuse guard: HUK HMAC buffers the whole message, so cap it. */
    if (WC_RTL8735B_HMAC_MAX_MSG != 0 &&
            need > (word32)WC_RTL8735B_HMAC_MAX_MSG) {
        return BUFFER_E;
    }
#endif
    if (need > ctx->cap) {
        newCap = (ctx->cap == 0) ? inSz : ctx->cap;
        while (newCap < need) {
            dbl = newCap << 1;
            if (dbl < newCap) {         /* overflow -> clamp to exact need */
                newCap = need;
                break;
            }
            newCap = dbl;
        }
        nb = (byte*)XREALLOC(ctx->buf, newCap, sha->heap,
                             DYNAMIC_TYPE_HMAC);
        if (nb == NULL) {
            return MEMORY_E;
        }
        ctx->buf = nb;
        ctx->cap = newCap;
    }
    XMEMCPY(ctx->buf + ctx->len, in, inSz);
    ctx->len += inSz;
    return 0;
}

/* Free the accumulation buffer for an Hmac (one-shot free after Final). The
 * WC_ALGO_TYPE_FREE op at wc_HmacFree also frees it via Rtl8735bHuk_HmacFreeSha. */
static void Rtl8735bHuk_HmacFreeCtx(Hmac* hmac)
{
    Rtl8735bHuk_HmacFreeSha(&hmac->hash.sha256);
}

/* Compute HMAC-SHA256(message) under the HUK-derived slot key. The slot key is
 * loaded by sk_cfg (LD_SK from WC_RTL8735B_DERIVED_WB_IDX); the key passed to
 * sk_init is unused in that mode but a valid aligned buffer is supplied so the
 * HAL never dereferences NULL. */
static int Rtl8735bHuk_Hmac(const byte* seed, const byte* msg, word32 msgSz,
    byte* digest)
{
    int    ret;
    u32    skCfg;
    const byte* msgA = msg;
    byte*  msgBounce = NULL;
    XALIGNED(32) byte dummyKey[WC_RTL8735B_KEYLEN] = { 0 };
    XALIGNED(32) byte digA[WC_SHA256_DIGEST_SIZE]   = { 0 };

    if (seed == NULL || digest == NULL) {
        return BAD_FUNC_ARG;
    }
    if (msgSz > 0 && msg == NULL) {
        return BAD_FUNC_ARG;
    }
    if (msgSz > WC_RTL8735B_BOUNCE_MAX) {
        return BAD_FUNC_ARG;   /* guard the (msgSz + 31) bounce allocation */
    }
    /* The HAL DMAs the message; the accumulation buffer is not guaranteed
     * 32-byte aligned, so stage an unaligned one on an aligned temp. */
    ret = Rtl8735b_BounceIn(msg, msgSz, &msgA, &msgBounce);
    if (ret != 0) {
        return ret;
    }

    ret = wolfSSL_CryptHwMutexLock();
    if (ret != 0) {
        goto cleanup;
    }
    ret = Rtl8735bHuk_DeriveSlotKey(seed);
    if (ret != 0) {
        goto unlock;
    }
    skCfg = (u32)hal_crypto_hmac_sha2_256_get_sk_cfg(
                (u8)WC_RTL8735B_HMAC_SK_OP, (u8)WC_RTL8735B_DERIVED_WB_IDX,
                (u8)WC_RTL8735B_HMAC_WB_OP, (u8)WC_RTL8735B_HMAC_WB_IDX);
    if (hal_crypto_hmac_sha2_256_sk_init(dummyKey, skCfg) != 0) {
        ret = WC_HW_E;
        goto unlock;
    }
    if (msgSz > 0) {
        if (hal_crypto_hmac_sha2_256_update(msgA, msgSz) != 0) {
            ret = WC_HW_E;
            goto unlock;
        }
    }
    if (hal_crypto_hmac_sha2_256_sk_final(digA) != 0) {
        ret = WC_HW_E;
        goto unlock;
    }
    XMEMCPY(digest, digA, WC_SHA256_DIGEST_SIZE);
    ret = 0;

unlock:
    ForceZero(digA, sizeof(digA));
    wolfSSL_CryptHwMutexUnLock();
cleanup:
    Rtl8735b_BounceFree(msgBounce, (byte*)msgA, msgSz);   /* scrub + free message */
    return ret;
}

