wolfSSL/wolfssl/wolfcrypt/src/port/realtek/rtl8735b.c
/* Route an HMAC request to the HUK backend. Handles only HMAC-SHA256 keyed by a
 * 32-byte HUK seed (the seed is the wc_HmacSetKey key, read from hmac->keyRaw);
 * anything else returns CRYPTOCB_UNAVAILABLE for software fallback. Update calls
 * (digest == NULL) accumulate; the final call (digest != NULL) produces the MAC
 * and frees the buffer. The HmacFree cleanup callback also arrives as a final
 * call with a throwaway digest; computing into it is harmless. */
static int Rtl8735bHuk_HmacCb(struct wc_CryptoInfo* info)
{
    Hmac*       hmac = info->hmac.hmac;
    const byte* seed;
    const byte* msg   = NULL;
    word32      msgSz = 0;
    Rtl8735bHmacCtx* ctx;
    int ret;

    if (hmac == NULL) {
        return CRYPTOCB_UNAVAILABLE;
    }
    if (info->hmac.macType != WC_SHA256 ||
            hmac->keyLen != WC_RTL8735B_KEYLEN || hmac->keyRaw == NULL) {
        /* Not our op. If this is a final/cleanup call (digest != NULL) and an
         * accumulation buffer is still attached -- e.g. an Hmac re-keyed to a
         * non-32-byte key after some Update calls, or wc_HmacFree -- free it
         * here so it cannot leak; the guard would short-circuit any later
         * free path too. HmacFreeCtx is a no-op when devCtx is NULL. */
        if (info->hmac.digest != NULL) {
            Rtl8735bHuk_HmacFreeCtx(hmac);
        }
        return CRYPTOCB_UNAVAILABLE;
    }
    seed = hmac->keyRaw;

    if (info->hmac.digest == NULL) {
        return Rtl8735bHuk_HmacAccumulate(hmac, info->hmac.in,
                                           info->hmac.inSz);
    }
    ctx = (Rtl8735bHmacCtx*)hmac->hash.sha256.devCtx;
    if (ctx != NULL) {
        msg   = ctx->buf;
        msgSz = ctx->len;
    }
    ret = Rtl8735bHuk_Hmac(seed, msg, msgSz, info->hmac.digest);
    Rtl8735bHuk_HmacFreeCtx(hmac);
    return ret;
}
#endif /* !NO_HMAC && !NO_SHA256 */

#if defined(HAVE_ECC) && defined(HAVE_ECC_SIGN)
/* The HUK-wrapped ECDSA scalar is AES-GCM decrypt-verified at unwrap
 * (Rtl8735bHuk_UnwrapScalar reuses Rtl8735bHuk_Gcm), so the ECDSA sign path
 * requires AES-GCM. */
#ifndef HAVE_AESGCM
    #error "RTL8735B HUK ECDSA needs HAVE_AESGCM (GCM-authenticated scalar unwrap)"
#endif

/* Big integers cross the HAL as little-endian 32-bit word arrays (word[0] =
 * least-significant limb), matching the SDK mbedTLS _alt bridge. ECC sizing
 * (WC_RTL8735B_ECC_BYTES/_WORDS) is defined near the top of this file. */

/* Scratch buffers for one HW ECDSA sign (~0.25KB). Heap-allocated under
 * WOLFSSL_SMALL_STACK (see Rtl8735bHuk_EccSignHw), on the stack otherwise. */
typedef struct Rtl8735bEccSignTmp {
    word32 hashW[WC_RTL8735B_ECC_WORDS];
    word32 kW[WC_RTL8735B_ECC_WORDS];
    word32 scW[WC_RTL8735B_ECC_WORDS];
    word32 rW[WC_RTL8735B_ECC_WORDS];
    word32 sW[WC_RTL8735B_ECC_WORDS];
    byte   be[WC_RTL8735B_ECC_BYTES];
    byte   rBe[WC_RTL8735B_ECC_BYTES];
    byte   sBe[WC_RTL8735B_ECC_BYTES];
} Rtl8735bEccSignTmp;

#ifdef HAVE_ECC_VERIFY
/* Scratch buffers for one HW ECDSA verify (heap-allocated under
 * WOLFSSL_SMALL_STACK, see Rtl8735bHuk_EccVerifyHw). */
typedef struct Rtl8735bEccVeriTmp {
    word32 qxW[WC_RTL8735B_ECC_WORDS];
    word32 qyW[WC_RTL8735B_ECC_WORDS];
    word32 rW[WC_RTL8735B_ECC_WORDS];
    word32 sW[WC_RTL8735B_ECC_WORDS];
    word32 hashW[WC_RTL8735B_ECC_WORDS];
    byte   qxBe[WC_RTL8735B_ECC_BYTES];
    byte   qyBe[WC_RTL8735B_ECC_BYTES];
    byte   rBe[WC_RTL8735B_ECC_BYTES];
    byte   sBe[WC_RTL8735B_ECC_BYTES];
    byte   hashBe[WC_RTL8735B_ECC_BYTES];
    byte   rDec[WC_RTL8735B_ECC_BYTES];  /* raw r from wc_ecc_sig_to_rs */
    byte   sDec[WC_RTL8735B_ECC_BYTES];  /* raw s from wc_ecc_sig_to_rs */
} Rtl8735bEccVeriTmp;
#endif

/* 32 big-endian bytes -> WC_RTL8735B_ECC_WORDS little-endian words. */
static void Rtl8735b_BeToLeWords(const byte* be, word32* w)
{
    int j;
    const byte* p;
    for (j = 0; j < WC_RTL8735B_ECC_WORDS; j++) {
        p = be + (WC_RTL8735B_ECC_BYTES - 4 * (j + 1));
        w[j] = ((word32)p[0] << 24) | ((word32)p[1] << 16) |
               ((word32)p[2] <<  8) |  (word32)p[3];
    }
}

/* Little-endian words -> 32 big-endian bytes (inverse of Rtl8735b_BeToLeWords). */
static void Rtl8735b_LeWordsToBe(const word32* w, byte* be)
{
    int j;
    byte* p;
    for (j = 0; j < WC_RTL8735B_ECC_WORDS; j++) {
        p = be + (WC_RTL8735B_ECC_BYTES - 4 * (j + 1));
        p[0] = (byte)(w[j] >> 24);
        p[1] = (byte)(w[j] >> 16);
        p[2] = (byte)(w[j] >>  8);
        p[3] = (byte)(w[j]);
    }
}

/* The HW ECDSA completion state (huk_ecdsaDone/Err/R/S/veriResult) is defined
 * near the top of this file with the other module state. */

/* ECDSA finish-interrupt callback (registered via hal_ecdsa_cb_handler): read
 * the error status and r,s, then flag completion. Mirrors the RealTek example. */
static void Rtl8735bHuk_EcdsaIrqCb(void* data)
{
    hal_ecdsa_adapter_t* a = (hal_ecdsa_adapter_t*)data;
    huk_ecdsaErr = (word32)hal_ecdsa_get_err_sta(a);
    hal_ecdsa_get_rs(a, (u32*)huk_ecdsaR, (u32*)huk_ecdsaS);
    huk_ecdsaDone = 1;
}

#ifdef HAVE_ECC_VERIFY
/* ECDSA verify finish-interrupt callback: read the verify error status and the
 * pass result (ECDSA_BIT_VERIFY_PASS -> non-zero == verified), then flag done. */
static void Rtl8735bHuk_EcdsaVeriIrqCb(void* data)
{
    hal_ecdsa_adapter_t* a = (hal_ecdsa_adapter_t*)data;
    huk_ecdsaErr   = (word32)hal_ecdsa_get_veri_err_sta(a);
    huk_veriResult = (word32)hal_ecdsa_get_veri_result(a);
    huk_ecdsaDone  = 1;
}
#endif

/* Right-align the message hash into a 32-byte big-endian block (leftmost 256
 * bits of the digest), zero-padded on the left. Caller converts to LE words. */
static void Rtl8735b_PadHashBe(const byte* hash, word32 hashlen, byte* be32)
{
    if (hashlen >= WC_RTL8735B_ECC_BYTES) {
        XMEMCPY(be32, hash, WC_RTL8735B_ECC_BYTES);
    }
    else {
        XMEMSET(be32, 0, WC_RTL8735B_ECC_BYTES);
        XMEMCPY(be32 + (WC_RTL8735B_ECC_BYTES - hashlen), hash, hashlen);
    }
}

/* Busy-wait for the ECDSA finish IRQ (sets huk_ecdsaDone), bounded by
 * WC_RTL8735B_ECDSA_SPIN; WC_RTL8735B_ECDSA_YIELD is an optional RTOS yield. */
static void Rtl8735b_EcdsaSpin(void)
{
    long spin;
    for (spin = 0; spin < WC_RTL8735B_ECDSA_SPIN && huk_ecdsaDone == 0; spin++) {
        WC_RTL8735B_ECDSA_YIELD();
    }
}

/* Generate a per-signature nonce k in [1, n-1] from the RNG, as LE words. The
 * curve order n comes from the wolfCrypt curve params (dp->order). */
static int Rtl8735b_GenK(WC_RNG* rng, const ecc_set_type* dp, word32* kW)
{
    byte   be[WC_RTL8735B_ECC_BYTES];
#ifdef WOLFSSL_SMALL_STACK
    mp_int* k;
    mp_int* n;
#else
    mp_int  k[1];   /* mp_int can be multi-KB with fastmath; heap on small stack */
    mp_int  n[1];
#endif
    int    ret;
    int    i;
    int    ok = 0;

    if (rng == NULL || dp == NULL) {
        return BAD_FUNC_ARG;
    }
#ifdef WOLFSSL_SMALL_STACK
    k = (mp_int*)XMALLOC(sizeof(mp_int) * 2, NULL, DYNAMIC_TYPE_TMP_BUFFER);
    if (k == NULL) {
        return MEMORY_E;
    }
    n = k + 1;
#endif
    ret = mp_init_multi(k, n, NULL, NULL, NULL, NULL);
    if (ret != 0) {
    #ifdef WOLFSSL_SMALL_STACK
        XFREE(k, NULL, DYNAMIC_TYPE_TMP_BUFFER);
    #endif
        return ret;
    }
    ret = mp_read_radix(n, dp->order, MP_RADIX_HEX);
    for (i = 0; ret == 0 && ok == 0 && i < 16; i++) {
        ret = wc_RNG_GenerateBlock(rng, be, WC_RTL8735B_ECC_BYTES);
        if (ret != 0) {
            break;
        }
        ret = mp_read_unsigned_bin(k, be, WC_RTL8735B_ECC_BYTES);
        if (ret != 0) {
            break;
        }
        if (!mp_iszero(k) && mp_cmp(k, n) == MP_LT) {
            ok = 1;
        }
    }
    if (ret == 0 && ok == 0) {
        ret = RNG_FAILURE_E;
    }
    if (ret == 0) {
        ret = mp_to_unsigned_bin_len(k, be, WC_RTL8735B_ECC_BYTES);
        if (ret == 0) {
            Rtl8735b_BeToLeWords(be, kW);
        }
    }
    ForceZero(be, sizeof(be));
    mp_forcezero(k);
    mp_clear(n);
#ifdef WOLFSSL_SMALL_STACK
    XFREE(k, NULL, DYNAMIC_TYPE_TMP_BUFFER);
#endif
    return ret;
}

/* Sign info->pk.eccsign over the HW ECDSA engine (P-256). The private scalar is
 * either the unwrapped INPUT scalar (otpPrkSel == 0) or sourced from OTP via
 * select_prk (otpPrkSel != 0, scalar never in software). On success the DER
 * signature is written to info->pk.eccsign.out/outlen.
 *
 * Follows the RealTek hal_ecdsa reference flow: set_curve(ECDSA_P256, NULL) uses
 * the engine's built-in P-256 constants (no curve table needed); load the
 * private key + nonce via hal_ecdsa_signature, then hal_ecdsa_hash marks the
 * hash ready, which STARTS the engine; completion arrives via the finish IRQ
 * (hal_ecdsa_cb_handler -> Rtl8735bHuk_EcdsaIrqCb). Big integers cross the HAL
 * as little-endian 32-bit word arrays. This is the opt-in useHwEngine path; the
 * default software sign delegates to wc_ecc_sign_hash. */
static int Rtl8735bHuk_EccSignHw(struct wc_CryptoInfo* info,
    const wc_Rtl8735b_EccKey* hk, const byte* scalar, word32 scalarSz)
{
    ecc_key* key = info->pk.eccsign.key;
#ifdef WOLFSSL_SMALL_STACK
    Rtl8735bEccSignTmp* t;
#else
    Rtl8735bEccSignTmp  t[1];
#endif
    int    ret;
    int    useOtp = (hk != NULL && hk->otpPrkSel != 0);

    /* The HW engine here is wired for P-256 (secp256r1). PkSign only routes P-256
     * here; this is a defensive hard error (not CRYPTOCB_UNAVAILABLE, which would
     * make the core retry a software sign on the keyless HUK device key). */
    if (key->dp == NULL || key->dp->size != WC_RTL8735B_ECC_BYTES ||
            key->dp->id != ECC_SECP256R1) {
        return BAD_FUNC_ARG;
    }
#ifdef WOLFSSL_SMALL_STACK
    t = (Rtl8735bEccSignTmp*)XMALLOC(sizeof(*t), NULL, DYNAMIC_TYPE_TMP_BUFFER);
    if (t == NULL) {
        return MEMORY_E;
    }
#endif
    XMEMSET(t, 0, sizeof(*t));

