wolfSSL/wolfssl/wolfcrypt/src/port/realtek/rtl8735b.c
    Rtl8735b_PadHashBe(info->pk.eccsign.in, info->pk.eccsign.inlen, t->be);
    Rtl8735b_BeToLeWords(t->be, t->hashW);

    ret = Rtl8735b_GenK(info->pk.eccsign.rng, key->dp, t->kW);
    if (ret != 0) {
        goto done;
    }
    if (!useOtp) {
        if (scalar == NULL || scalarSz == 0 ||
                scalarSz > WC_RTL8735B_ECC_BYTES) {
            ret = BAD_FUNC_ARG;
            goto done;
        }
        XMEMSET(t->be, 0, sizeof(t->be));
        XMEMCPY(t->be + (WC_RTL8735B_ECC_BYTES - scalarSz), scalar, scalarSz);
        Rtl8735b_BeToLeWords(t->be, t->scW);
    }

    XMEMSET(&huk_ecdsaAdapter, 0, sizeof(huk_ecdsaAdapter));
    ret = wolfSSL_CryptHwMutexLock();
    if (ret != 0) {
        goto done;
    }
    if (hal_ecdsa_init(&huk_ecdsaAdapter) != 0) {
        ret = WC_HW_E;
        goto unlock;
    }
    huk_ecdsaDone = 0;
    huk_ecdsaErr  = 0;
    hal_ecdsa_cb_handler(&huk_ecdsaAdapter,
                         (ecdsa_irq_user_cb_t)Rtl8735bHuk_EcdsaIrqCb, &huk_ecdsaAdapter);
    /* P-256: NULL curve table -> the engine uses its built-in constants. */
    hal_ecdsa_set_curve(&huk_ecdsaAdapter, ECDSA_P256, NULL, ECDSA_256_BIT);
    hal_ecdsa_set_mode(&huk_ecdsaAdapter, ECDSA_SIGN, ECDSA_NONE);
    if (useOtp) {
        hal_ecdsa_select_prk(&huk_ecdsaAdapter, (ecdsa_sel_prk_t)hk->otpPrkSel);
    }
    /* Load priv + nonce, then mark the hash ready -- that starts the engine.
     * The HAL word pointers are the vendor u32 type (not necessarily wolfCrypt's
     * word32 on this ABI), so cast the 32-bit word arrays at the boundary. */
    hal_ecdsa_signature(&huk_ecdsaAdapter, (u32*)(useOtp ? NULL : t->scW), (u32*)t->kW);
    hal_ecdsa_hash(&huk_ecdsaAdapter, (u32*)t->hashW);

    /* Wait for the finish IRQ (the callback reads err + r,s and sets the flag). */
    Rtl8735b_EcdsaSpin();
    hal_ecdsa_deinit(&huk_ecdsaAdapter);

    if (huk_ecdsaDone == 0) {
        ret = WC_HW_E;
    }
    else if (huk_ecdsaErr != 0) {
        ret = WC_HW_E;
    }
    else {
        XMEMCPY(t->rW, huk_ecdsaR, sizeof(t->rW));
        XMEMCPY(t->sW, huk_ecdsaS, sizeof(t->sW));
        ret = 0;
    }
unlock:
    wolfSSL_CryptHwMutexUnLock();
    if (ret == 0) {
        Rtl8735b_LeWordsToBe(t->rW, t->rBe);
        Rtl8735b_LeWordsToBe(t->sW, t->sBe);
        ret = wc_ecc_rs_raw_to_sig(t->rBe, WC_RTL8735B_ECC_BYTES,
                                   t->sBe, WC_RTL8735B_ECC_BYTES,
                                   info->pk.eccsign.out, info->pk.eccsign.outlen);
    }
done:
    ForceZero(t, sizeof(*t));   /* scrub nonce + scalar (and the rest) */
#ifdef WOLFSSL_SMALL_STACK
    XFREE(t, NULL, DYNAMIC_TYPE_TMP_BUFFER);
#endif
    return ret;
}

#ifdef HAVE_ECC_VERIFY
/* Verify an ECDSA P-256 signature over the HW engine (general offload; any
 * P-256 public key, no HUK context needed). Sets *res = 1 if the signature
 * verifies, 0 otherwise. Same engine flow as sign: load inputs (here the public
 * key + r + s via hal_ecdsa_verify), then hal_ecdsa_hash marks the hash ready to
 * start; completion via the verify finish IRQ (ECDSA_BIT_VERIFY_PASS). */
static int Rtl8735bHuk_EccVerifyHw(struct wc_CryptoInfo* info)
{
    ecc_key* key = info->pk.eccverify.key;
    hal_ecdsa_veri_input_t vin;
#ifdef WOLFSSL_SMALL_STACK
    Rtl8735bEccVeriTmp* t;
#else
    Rtl8735bEccVeriTmp  t[1];
#endif
    word32 qxLen, qyLen, rLen, sLen;
    int    ret;

    if (key == NULL || info->pk.eccverify.res == NULL || key->dp == NULL ||
            key->dp->id != ECC_SECP256R1) {
        return CRYPTOCB_UNAVAILABLE;     /* non-P256 -> software verify */
    }
    *info->pk.eccverify.res = 0;
#ifdef WOLFSSL_SMALL_STACK
    t = (Rtl8735bEccVeriTmp*)XMALLOC(sizeof(*t), NULL, DYNAMIC_TYPE_TMP_BUFFER);
    if (t == NULL) {
        return MEMORY_E;
    }
#endif
    XMEMSET(t, 0, sizeof(*t));

    qxLen = WC_RTL8735B_ECC_BYTES;
    qyLen = WC_RTL8735B_ECC_BYTES;
    ret = wc_ecc_export_public_raw(key, t->qxBe, &qxLen, t->qyBe, &qyLen);
    if (ret != 0 || qxLen != WC_RTL8735B_ECC_BYTES ||
            qyLen != WC_RTL8735B_ECC_BYTES) {
        ret = CRYPTOCB_UNAVAILABLE;      /* fall back to software verify */
        goto done;
    }
    Rtl8735b_BeToLeWords(t->qxBe, t->qxW);
    Rtl8735b_BeToLeWords(t->qyBe, t->qyW);

    /* DER signature -> raw r,s -> right-aligned 32 bytes -> LE words. Decode
     * into dedicated rDec/sDec scratch (never the public-key or hash buffers),
     * then zero-extend into rBe/sBe. */
    rLen = WC_RTL8735B_ECC_BYTES;
    sLen = WC_RTL8735B_ECC_BYTES;
    ret = wc_ecc_sig_to_rs(info->pk.eccverify.sig, info->pk.eccverify.siglen,
                           t->rDec, &rLen, t->sDec, &sLen);
    if (ret != 0 || rLen > WC_RTL8735B_ECC_BYTES ||
            sLen > WC_RTL8735B_ECC_BYTES) {
        ret = CRYPTOCB_UNAVAILABLE;
        goto done;
    }
    XMEMCPY(t->rBe + (WC_RTL8735B_ECC_BYTES - rLen), t->rDec, rLen);
    Rtl8735b_BeToLeWords(t->rBe, t->rW);
    XMEMCPY(t->sBe + (WC_RTL8735B_ECC_BYTES - sLen), t->sDec, sLen);
    Rtl8735b_BeToLeWords(t->sBe, t->sW);

    Rtl8735b_PadHashBe(info->pk.eccverify.hash, info->pk.eccverify.hashlen,
                       t->hashBe);
    Rtl8735b_BeToLeWords(t->hashBe, t->hashW);

    XMEMSET(&huk_ecdsaAdapter, 0, sizeof(huk_ecdsaAdapter));
    ret = wolfSSL_CryptHwMutexLock();
    if (ret != 0) {
        goto done;
    }
    if (hal_ecdsa_init(&huk_ecdsaAdapter) != 0) {
        ret = WC_HW_E;
        goto unlock;
    }
    huk_ecdsaDone  = 0;
    huk_ecdsaErr   = 0;
    huk_veriResult = 0;
    hal_ecdsa_cb_handler(&huk_ecdsaAdapter,
                         (ecdsa_irq_user_cb_t)Rtl8735bHuk_EcdsaVeriIrqCb,
                         &huk_ecdsaAdapter);
    hal_ecdsa_set_curve(&huk_ecdsaAdapter, ECDSA_P256, NULL, ECDSA_256_BIT);
    hal_ecdsa_set_mode(&huk_ecdsaAdapter, ECDSA_VERI, ECDSA_NONE);
    vin.ppub_key_x = (u32*)t->qxW;
    vin.ppub_key_y = (u32*)t->qyW;
    vin.pr_adr     = (u32*)t->rW;
    vin.ps_adr     = (u32*)t->sW;
    hal_ecdsa_verify(&huk_ecdsaAdapter, &vin);          /* load pubkey + r + s */
    hal_ecdsa_hash(&huk_ecdsaAdapter, (u32*)t->hashW);  /* mark hash ready -> start */

