wolfSSL/wolfssl/wolfcrypt/src/port/realtek/rtl8735b.c
    Rtl8735b_EcdsaSpin();
    hal_ecdsa_deinit(&huk_ecdsaAdapter);

    if (huk_ecdsaDone == 0) {
        ret = WC_HW_E;
    }
    else {
        /* A completed verify is success (ret 0); *res reflects pass/fail. A bad
         * signature is not an error -- it just yields res = 0. */
        *info->pk.eccverify.res =
            (huk_ecdsaErr == 0 && huk_veriResult != 0) ? 1 : 0;
        ret = 0;
    }
unlock:
    wolfSSL_CryptHwMutexUnLock();
done:
    ForceZero(t, sizeof(*t));   /* one scrub convention with the sign path */
#ifdef WOLFSSL_SMALL_STACK
    XFREE(t, NULL, DYNAMIC_TYPE_TMP_BUFFER);
#endif
    return ret;
}
#endif /* HAVE_ECC_VERIFY */

/* Unwrap the HUK-wrapped private scalar (hk->plainLen bytes). AES-GCM decrypt-
 * verify under the HUK-derived key (reusing the GCM path): a tampered/wrong blob
 * fails here with AES_GCM_AUTH_E, not silently as a garbage scalar downstream. */
static int Rtl8735bHuk_UnwrapScalar(const wc_Rtl8735b_EccKey* hk,
    byte* scalar, word32 scalarSz)
{
    (void)scalarSz;   /* out length is hk->plainLen (GCM: ciphertext == plaintext) */
    return Rtl8735bHuk_Gcm(0, hk->seed, hk->wrapped, hk->plainLen, scalar,
                           hk->iv, hk->ivSz, NULL, 0, (byte*)hk->tag, hk->tagSz);
}

/* Route an ECDSA sign request to the HUK backend (wc_Rtl8735b_EccKey via
 * key->devCtx). Modes: 1 OTP-resident (scalar stays in OTP); 2 GCM-unwrap the
 * wrapped scalar then HW sign; 3 GCM-unwrap then software sign. The unwrap is
 * AES-GCM-authenticated (needs HAVE_AESGCM). A plain ecc_key with no devCtx is a
 * general HW offload. The wrapped blob unwraps only on its origin HUK. */
static int Rtl8735bHuk_PkSign(struct wc_CryptoInfo* info)
{
    ecc_key* key = info->pk.eccsign.key;
    const wc_Rtl8735b_EccKey* hk;
    ecc_key* tmp = NULL;
    int      ret;
    int      curveId;
    word32   scalarSz;
#ifdef WOLFSSL_SMALL_STACK
    byte*    scalar = NULL;
#else
    byte     scalar[MAX_ECC_BYTES];
#endif

    if (key == NULL) {
        return CRYPTOCB_UNAVAILABLE;
    }
#ifdef WOLFSSL_SMALL_STACK
    scalar = (byte*)XMALLOC(MAX_ECC_BYTES, NULL, DYNAMIC_TYPE_TMP_BUFFER);
    if (scalar == NULL) {
        return MEMORY_E;
    }
#endif

    /* General HW offload: a plain ecc_key (no HUK devCtx) signed via the HW
     * engine with its own scalar. P-256 with a usable private key only. */
    if (key->devCtx == NULL) {
        if (key->dp == NULL || key->dp->id != ECC_SECP256R1 ||
                (key->type != ECC_PRIVATEKEY &&
                 key->type != ECC_PRIVATEKEY_ONLY)) {
            ret = CRYPTOCB_UNAVAILABLE;
            goto cleanup;
        }
        scalarSz = MAX_ECC_BYTES;
        ret = wc_ecc_export_private_only(key, scalar, &scalarSz);
        if (ret != 0) {
            ret = CRYPTOCB_UNAVAILABLE; /* fall back to software */
            goto cleanup;
        }
        /* HW failure (e.g. finish-IRQ timeout) is surfaced verbatim, not masked
         * by a silent software fall-through (which would hide engine faults). */
        ret = Rtl8735bHuk_EccSignHw(info, NULL, scalar, scalarSz);
        goto cleanup;
    }
    hk = (const wc_Rtl8735b_EccKey*)key->devCtx;

    /* Mode 1: OTP-resident scalar -- no seed/wrapped blob needed. */
    if (hk->useHwEngine && hk->otpPrkSel != 0) {
        ret = Rtl8735bHuk_EccSignHw(info, hk, NULL, 0);
        goto cleanup;
    }

    /* Modes 2/3 need the seed + GCM-wrapped scalar (ciphertext + iv + tag). */
    if (hk->seed == NULL || hk->seedSz != WC_RTL8735B_KEYLEN ||
            hk->wrapped == NULL || hk->iv == NULL || hk->tag == NULL) {
        ret = CRYPTOCB_UNAVAILABLE;
        goto cleanup;
    }
    if (hk->plainLen == 0 ||
            hk->wrappedLen != hk->plainLen ||   /* GCM: ciphertext == plaintext */
            hk->plainLen > WC_RTL8735B_MAX_WRAPPED ||
            hk->plainLen > (word32)MAX_ECC_BYTES) {
        ret = BAD_FUNC_ARG;
        goto cleanup;
    }
    /* The caller must set the curve (wc_ecc_set_curve): a wrapped 32-byte scalar
     * is not necessarily P-256 (e.g. secp256k1), so do NOT assume it -- signing
     * under the wrong curve would silently produce a bad signature. */
    if (key->dp == NULL) {
        ret = BAD_FUNC_ARG;
        goto cleanup;
    }
    curveId  = key->dp->id;
    scalarSz = hk->plainLen;

    ret = Rtl8735bHuk_UnwrapScalar(hk, scalar, scalarSz);
    if (ret != 0) {
        goto cleanup;
    }

    /* Mode 2: HW-engine sign for P-256; other curves fall through to the software
     * sign below with the same unwrapped scalar (CRYPTOCB_UNAVAILABLE here would
     * make the core retry a software sign on the keyless HUK device key). */
    if (hk->useHwEngine && key->dp->id == ECC_SECP256R1) {
        ret = Rtl8735bHuk_EccSignHw(info, hk, scalar, scalarSz);
        goto cleanup;
    }

    /* Mode 3: software sign. The temp key uses INVALID_DEVID so the inner sign
     * does not re-enter this callback. */
    tmp = (ecc_key*)XMALLOC(sizeof(ecc_key), NULL, DYNAMIC_TYPE_ECC);
    if (tmp == NULL) {
        ret = MEMORY_E;
        goto cleanup;
    }
    ret = wc_ecc_init_ex(tmp, NULL, INVALID_DEVID);
    if (ret == 0) {
        ret = wc_ecc_import_private_key_ex(scalar, scalarSz, NULL, 0, tmp,
                                           curveId);
        if (ret == 0) {
            ret = wc_ecc_sign_hash(info->pk.eccsign.in, info->pk.eccsign.inlen,
                                   info->pk.eccsign.out, info->pk.eccsign.outlen,
                                   info->pk.eccsign.rng, tmp);
        }
        wc_ecc_free(tmp);
    }

cleanup:
#ifdef WOLFSSL_SMALL_STACK
    if (scalar != NULL) {
        ForceZero(scalar, MAX_ECC_BYTES);
        XFREE(scalar, NULL, DYNAMIC_TYPE_TMP_BUFFER);
    }
#else
    ForceZero(scalar, sizeof(scalar));
#endif
    if (tmp != NULL) {
        XFREE(tmp, NULL, DYNAMIC_TYPE_ECC);
    }
    return ret;
}
#endif /* HAVE_ECC && HAVE_ECC_SIGN */

#ifndef WC_NO_RNG
/* huk_trngInit (secure-TRNG lazy-init flag) is defined near the top of this file
 * with the other module state. */

/* Fill a caller buffer with entropy from the secure (self-tested) TRNG. Exposed
 * as the crypto-callback SEED source so an app that inits its RNG with
 * WC_HUK_DEVID (wc_InitRng_ex(&rng, NULL, WC_HUK_DEVID)) gets HW-seeded entropy
 * without wiring CUSTOM_RAND_GENERATE_SEED. */
static int Rtl8735b_Seed(byte* seed, word32 sz)
{
    int    ret;
    word32 i;
    word32 n;
    u32    r;

