wolfSSL/wolfssl/wolfcrypt/src/port/realtek/rtl8735b.c
    if (seed == NULL) {
        return BAD_FUNC_ARG;
    }
    if (sz == 0) {
        return 0;
    }
    ret = wolfSSL_CryptHwMutexLock();
    if (ret != 0) {
        return ret;
    }
    if (!huk_trngInit) {
        if (hal_trng_sec_init() != HAL_OK) {
            wolfSSL_CryptHwMutexUnLock();
            return WC_HW_E;
        }
        huk_trngInit = 1;
    }
    /* Fill from the secure TRNG a 32-bit word at a time (hal_trng_sec_get_rand). */
    for (i = 0; i < sz; ) {
        r = hal_trng_sec_get_rand();
        n = (sz - i) < 4u ? (sz - i) : 4u;
        XMEMCPY(seed + i, &r, n);
        i += n;
    }
    ret = 0;
    wolfSSL_CryptHwMutexUnLock();
    return ret;
}
#endif /* WC_NO_RNG */

/* The crypto-callback device entry point (registered by
 * wc_Rtl8735b_HukRegister). Returns CRYPTOCB_UNAVAILABLE for anything it does
 * not handle so the caller falls back to software.
 *
 * cmsis_os.h (AmebaPro2 FreeRTOS) does "#define free vPortFree", which collides
 * with the wc_CryptoInfo ".free" union member used below. Drop the macro for
 * this one function (preprocessor-only, no push_macro), then restore it after so
 * XFREE keeps mapping to vPortFree. On a host build (no such macro) both #ifdef
 * blocks are skipped. */
#ifdef free
    #undef free
    #define RTL8735B_FREE_WAS_MACRO
#endif
static int Rtl8735b_CryptoDevCb(int devId, struct wc_CryptoInfo* info,
    void* ctx)
{
    (void)devId;
    (void)ctx;
    if (info == NULL) {
        return CRYPTOCB_UNAVAILABLE;
    }

    switch (info->algo_type) {
#ifndef NO_AES
        case WC_ALGO_TYPE_CIPHER:
            return Rtl8735bHuk_Cipher(info);
#endif
#if !defined(NO_HMAC) && !defined(NO_SHA256)
        case WC_ALGO_TYPE_HMAC:
            return Rtl8735bHuk_HmacCb(info);
        /* Manage the HMAC accumulation buffer stored on the inner SHA-256 devCtx:
         * deep-copy on wc_HmacCopy, free on wc_HmacFree. NULL devCtx -> no-op, so
         * this is safe for any non-HUK SHA-256 object routed here too. */
        case WC_ALGO_TYPE_COPY:
            if (info->copy.algo == WC_ALGO_TYPE_HASH &&
                    info->copy.type == WC_HASH_TYPE_SHA256) {
                return Rtl8735bHuk_HmacCopySha((wc_Sha256*)info->copy.src,
                                               (wc_Sha256*)info->copy.dst);
            }
            return CRYPTOCB_UNAVAILABLE;
        case WC_ALGO_TYPE_FREE:
            /* ".free" resolves to the member: the SDK's free macro is dropped for
             * this function (see the #undef above its definition). */
            if (info->free.algo == WC_ALGO_TYPE_HASH &&
                    info->free.type == WC_HASH_TYPE_SHA256) {
                Rtl8735bHuk_HmacFreeSha((wc_Sha256*)info->free.obj);
                return 0;
            }
            return CRYPTOCB_UNAVAILABLE;
#endif
#if defined(HAVE_ECC) && defined(HAVE_ECC_SIGN)
        case WC_ALGO_TYPE_PK:
            if (info->pk.type == WC_PK_TYPE_ECDSA_SIGN) {
                return Rtl8735bHuk_PkSign(info);
            }
        #ifdef HAVE_ECC_VERIFY
            if (info->pk.type == WC_PK_TYPE_ECDSA_VERIFY) {
                return Rtl8735bHuk_EccVerifyHw(info);
            }
        #endif
            return CRYPTOCB_UNAVAILABLE;
#endif
#ifndef WC_NO_RNG
        case WC_ALGO_TYPE_SEED:
            return Rtl8735b_Seed(info->seed.seed, info->seed.sz);
#endif
        default:
            return CRYPTOCB_UNAVAILABLE;
    }
}
#ifdef RTL8735B_FREE_WAS_MACRO
    #define free vPortFree   /* restore the cmsis_os.h macro for XFREE below */
    #undef RTL8735B_FREE_WAS_MACRO
#endif

/* Register the AmebaPro2 HUK device at devId (e.g. WC_HUK_DEVID). After this,
 * objects whose devId is set to it at init route transparently to the HUK
 * crypto engine. */
int wc_Rtl8735b_HukRegister(int devId)
{
    int ret = Rtl8735bHuk_Init(NULL);
    if (ret != 0) {
        return ret;
    }
    return wc_CryptoCb_RegisterDevice(devId, Rtl8735b_CryptoDevCb, NULL);
}

int wc_Rtl8735b_HukUnRegister(int devId)
{
    int ret;
    wc_CryptoCb_UnRegisterDevice(devId);
    /* Scrub the mutex-guarded globals. Take the mutex so this cannot race an
     * in-flight op (in practice a shutdown call, nothing in flight); a lock
     * failure is surfaced so the caller knows the scrub did not run. */
    ret = wolfSSL_CryptHwMutexLock();
    if (ret == 0) {
#ifndef WC_RTL8735B_NO_DERIVE_CACHE
        ForceZero(huk_seedCache, sizeof(huk_seedCache));   /* next op re-derives */
        huk_haveCache = 0;
#endif
#ifndef WC_NO_RNG
        huk_trngInit = 0;   /* re-arm TRNG init for a later re-register */
#endif
        wolfSSL_CryptHwMutexUnLock();
    }
    return ret;
}

#ifdef WOLFSSL_RTL8735B_HOST_TEST
/* Host self-test for the silicon-independent helpers (no HAL crypto needed):
 * BE<->LE word conversion, the AES-CTR counter increment, the HMAC accumulator
 * growth/overflow/cap logic, and the bounce-buffer alignment helpers. The
 * --enable-rtl8735b build is a compile + these-KATs gate; the cipher / GCM /
 * ECDSA crypto correctness is validated on RTL8735B hardware, not here. Returns
 * 0 on success, or a negative code identifying the first failing check. */
int wc_Rtl8735b_HukSelfTest(void)
{
#if defined(HAVE_ECC) && defined(HAVE_ECC_SIGN)
    static const byte kBe[WC_RTL8735B_ECC_BYTES] = {
        0x00,0x01,0x02,0x03, 0x04,0x05,0x06,0x07,
        0x08,0x09,0x0a,0x0b, 0x0c,0x0d,0x0e,0x0f,
        0x10,0x11,0x12,0x13, 0x14,0x15,0x16,0x17,
        0x18,0x19,0x1a,0x1b, 0x1c,0x1d,0x1e,0x1f
    };
    word32 w[WC_RTL8735B_ECC_WORDS];
    byte   be2[WC_RTL8735B_ECC_BYTES];
#endif
#ifdef WOLFSSL_AES_COUNTER
    byte ctr[WC_AES_BLOCK_SIZE];
    int  i;
#endif
#if !defined(NO_HMAC) && !defined(NO_SHA256)
    Hmac             hmac;
    Rtl8735bHmacCtx* hctx;
    Rtl8735bHmacCtx* dctx;
    wc_Sha256        shaDst;
    byte             chunk[5];
#endif
    const byte* al;
    byte*       alloc;
    byte        aligned[64];
    byte*       ap;

#if defined(HAVE_ECC) && defined(HAVE_ECC_SIGN)
    /* BE->LE limb layout: word[0] is the least-significant limb (last 4 BE
     * bytes), word[N-1] the most-significant (first 4 BE bytes). */
    Rtl8735b_BeToLeWords(kBe, w);
    if (w[0] != 0x1c1d1e1fUL ||
            w[WC_RTL8735B_ECC_WORDS - 1] != 0x00010203UL) {
        return -1;
    }
    Rtl8735b_LeWordsToBe(w, be2);       /* round-trip back to big-endian */
    if (XMEMCMP(kBe, be2, sizeof(kBe)) != 0) {
        return -2;
    }
#endif

#ifdef WOLFSSL_AES_COUNTER
    /* All-ones -> all-zero full rollover. */
    for (i = 0; i < WC_AES_BLOCK_SIZE; i++) {
        ctr[i] = 0xFF;
    }
    Rtl8735bHuk_IncCtr(ctr);
    for (i = 0; i < WC_AES_BLOCK_SIZE; i++) {
        if (ctr[i] != 0x00) {
            return -3;
        }
    }
    /* Low-byte carry: 0x..00FF -> 0x..0100. */
    XMEMSET(ctr, 0, sizeof(ctr));
    ctr[WC_AES_BLOCK_SIZE - 1] = 0xFF;
    Rtl8735bHuk_IncCtr(ctr);
    if (ctr[WC_AES_BLOCK_SIZE - 1] != 0x00 ||
            ctr[WC_AES_BLOCK_SIZE - 2] != 0x01) {
        return -4;
    }
#endif

#if !defined(NO_HMAC) && !defined(NO_SHA256)
    /* Accumulator: growth, overflow guard, and the MAX_MSG cap. */
    XMEMSET(&hmac, 0, sizeof(hmac));
    chunk[0] = 0xAA; chunk[1] = 0xBB; chunk[2] = 0xCC;
    chunk[3] = 0xDD; chunk[4] = 0xEE;
    if (Rtl8735bHuk_HmacAccumulate(&hmac, chunk, 3) != 0) {
        return -5;
    }
    if (Rtl8735bHuk_HmacAccumulate(&hmac, chunk + 3, 2) != 0) {
        return -6;
    }
    hctx = (Rtl8735bHmacCtx*)hmac.hash.sha256.devCtx;
    if (hctx == NULL || hctx->len != 5 ||
            XMEMCMP(hctx->buf, chunk, 5) != 0) {
        Rtl8735bHuk_HmacFreeCtx(&hmac);
        return -7;
    }
    /* word32 overflow guard: need = len + inSz wraps below len -> BUFFER_E.
     * (Returns before touching the buffer, so the tiny chunk pointer is safe.) */
    if (Rtl8735bHuk_HmacAccumulate(&hmac, chunk, 0xFFFFFFFFUL) != BUFFER_E) {
        Rtl8735bHuk_HmacFreeCtx(&hmac);
        return -8;
    }
#if WC_RTL8735B_HMAC_MAX_MSG != 0
    /* Cap: need beyond WC_RTL8735B_HMAC_MAX_MSG -> BUFFER_E (returns pre-alloc). */
    if (Rtl8735bHuk_HmacAccumulate(&hmac, chunk,
            (word32)WC_RTL8735B_HMAC_MAX_MSG) != BUFFER_E) {
        Rtl8735bHuk_HmacFreeCtx(&hmac);
        return -9;
    }
#endif
    /* Copy op (the wc_HmacCopy fix): dst must own a distinct buffer with the same
     * contents -- not an alias (double free) -- and carry src's devId + heap so
     * dst's later copy/free routes back here. src still has len==5. */
    hmac.hash.sha256.devId = WC_HUK_DEVID;     /* sentinel: must survive the copy */
    XMEMSET(&shaDst, 0, sizeof(shaDst));
    shaDst.devCtx = hmac.hash.sha256.devCtx;   /* mimic wc_Sha256Copy's shallow alias */
    if (Rtl8735bHuk_HmacCopySha(&hmac.hash.sha256, &shaDst) != 0) {
        Rtl8735bHuk_HmacFreeCtx(&hmac);
        return -20;
    }
    dctx = (Rtl8735bHmacCtx*)shaDst.devCtx;
    hctx = (Rtl8735bHmacCtx*)hmac.hash.sha256.devCtx;
    if (dctx == NULL || dctx == hctx || dctx->buf == hctx->buf ||
            dctx->len != 5 || XMEMCMP(dctx->buf, chunk, 5) != 0 ||
            shaDst.devId != WC_HUK_DEVID ||        /* devId carried over */
            shaDst.heap  != hmac.hash.sha256.heap) /* heap carried over */ {
        Rtl8735bHuk_HmacFreeSha(&shaDst);
        Rtl8735bHuk_HmacFreeCtx(&hmac);
        return -21;
    }
    Rtl8735bHuk_HmacFreeSha(&shaDst);          /* free the copy independently */
    Rtl8735bHuk_HmacFreeCtx(&hmac);            /* ... then the original: no double free */
    if (hmac.hash.sha256.devCtx != NULL || shaDst.devCtx != NULL) {
        return -22;
    }
#endif

    /* Bounce helpers: aligned fast-path, unaligned bounce, sz==0, and out. */
    ap = WC_RTL8735B_ALIGN_UP32(aligned);   /* a known 32-byte-aligned pointer */
    if (Rtl8735b_BounceIn(ap, 16, &al, &alloc) != 0 ||
            alloc != NULL || al != ap) {
        return -11;                          /* already aligned -> no alloc */
    }
    if (Rtl8735b_BounceIn(ap + 1, 16, &al, &alloc) != 0 || alloc == NULL ||
            !WC_RTL8735B_IS_ALIGNED32(al) || XMEMCMP(al, ap + 1, 16) != 0) {
        Rtl8735b_BounceFree(alloc, (byte*)al, 16);
        return -12;                          /* unaligned -> aligned copy */
    }
    Rtl8735b_BounceFree(alloc, (byte*)al, 16);
    if (Rtl8735b_BounceIn(ap, 0, &al, &alloc) != 0 || alloc != NULL) {
        return -13;                          /* sz==0 -> no alloc */
    }
    if (Rtl8735b_BounceOut(16, &ap, &alloc) != 0 || alloc == NULL ||
            !WC_RTL8735B_IS_ALIGNED32(ap)) {
        Rtl8735b_BounceFree(alloc, ap, 16);
        return -14;
    }
    Rtl8735b_BounceFree(alloc, ap, 16);

    return 0;
}
#endif /* WOLFSSL_RTL8735B_HOST_TEST */

#endif /* WOLFSSL_RTL8735B_HUK (device implementation) */

#endif /* WOLF_CRYPTO_CB */

#endif /* WOLFSSL_RTL8735B_HUK || WOLFSSL_RTL8735B_AES */
